{
    "pageTitle": "Bijektiver Basis-6 Rechner & Explorer",
    "pageDescription": "Ein interaktives Lehrmittel zum Berechnen und Erforschen des bijektiven Basis-6-Zahlensystems (ein Zahlensystem ohne Null). Mit Live-Konverter, Referenztabellen und ausführlichen Erklärungen.",
    "mainTitle": "Bijektiver Basis-6 Rechner & Explorer",
    "tabCalculator": "🧮 Rechner & Explorer",
    "tabTables": "📚 Referenztabellen",
    "tabExplanations": "🎓 Erklärungen",
    "liveConverterTitle": "Live-Konvertierungs-Explorer",
    "liveConverterDesc": "Geben Sie eine Dezimalzahl ein, um ihre Darstellung in verschiedenen Systemen in Echtzeit zu sehen.",
    "decimalInputLabel": "Geben Sie eine Dezimalzahl ein:",
    "calculatorTitle": "Bijektiver Mathe-Rechner",
    "calculatorDesc": "Geben Sie zwei bijektive Basis-6-Zahlen ein, um die Ergebnisse für alle Standard-Rechenoperationen zu sehen.",
    "num1Placeholder": "Erste Zahl",
    "num2Placeholder": "Zweite Zahl",
    "calculateBtn": "Alle Operationen berechnen",
    "resultsTitle": "Ergebnisse",
    "additionTableTitle": "Additionstabelle (1 bis 12)",
    "multiplicationTableTitle": "Multiplikationstabelle (1 bis 12)",
    "primerTitle": "Eine Einführung in Zahlensysteme",
    "primerDesc1": "Die meisten von uns verwendeten Zahlensysteme sind <strong>positionell</strong>. Das bedeutet, der Wert einer Ziffer hängt von ihrer Position innerhalb einer Zahl ab. Die \"Basis\" eines Systems gibt an, wie viele eindeutige Ziffern verwendet werden. Der Wert jeder Position ist eine Potenz der Basis, beginnend bei 0 auf der rechten Seite.",
    "primerDesc2": "In diesen Standardsystemen ist die Ziffer <strong>Null</strong> unerlässlich. Sie ist nicht nur eine Zahl, sondern ein fundamentaler <strong>Platzhalter</strong>. Sie kennzeichnet eine leere Position, wie die Zehnerstelle in <code>101</code>. Das bijektive System, das Sie hier erforschen, ist faszinierend, weil es ohne diesen Platzhalter auskommt.",
    "explanationTitle": "Das bijektive System verstehen",
    "explanationDesc1": "Dieses System ist eine <strong>bijektive Basis-6-Numerierung</strong>. Es ist positionell, aber mit zwei wesentlichen Unterschieden: Es hat keine Null, und seine Ziffern laufen von 1 bis 6. Da es keine Null als Platzhalter gibt, \"rollt\" das System anders über. Nach <code>6</code> kommt die nächste Zahl <code>11</code>.",
    "algoTitle": "Der Konvertierungsalgorithmus erklärt",
    "algoDesc": "Der Trick bei der Konvertierung von Dezimal zu bijektiv Basis-6 besteht darin, das Zahlensystem vorübergehend zu verschieben. Computer arbeiten natürlich mit Resten von 0 bis 5, aber unsere Ziffern sind 1 bis 6. Wir überbrücken diese Lücke, indem wir vor jeder Berechnung 1 subtrahieren.",
    "applicationsTitle": "Praktische Anwendungen",
    "applicationsDesc": "Die bijektive Numerierung ist mehr als eine Kuriosität; sie löst reale Probleme in der Informatik.",
    "advancedTitle": "Tiefere mathematische Verbindungen",
    "advancedDesc": "Die Eigenschaften der bijektiven Numerierung erstrecken sich auf komplexere Bereiche der Informatik und Mathematik, wie Kryptographie und algorithmische Aufzählung.",
    "donationBtn": "Dieses Projekt unterstützen",
    "githubLink": "Projektquelle verfügbar auf",
    "licenseLink": "Veröffentlicht unter der",
    "errorInput": "Bitte geben Sie beide Zahlen ein.",
    "errorInvalid": "Die Eingabe enthält ein ungültiges Zeichen '{char}'. Nur Ziffern von 1-6 sind erlaubt.",
    "errorEmpty": "Die Eingabe darf nicht leer sein."
}
