{
    "pageTitle": "Bijektiver Base-6 Rechner & Explorer",
    "pageDescription": "Ein interaktives Lehrmittel zum Berechnen und Erforschen des bijektiven Zahlensystems zur Basis 6, das keine Null hat. Mit Echtzeit-Konverter und Referenztabellen.",
    "mainTitle": "Bijektiver Base-6 Rechner & Explorer",
    "tabCalculator": "Rechner",
    "tabTables": "Referenztabellen",
    "tabProsCons": "Vor- & Nachteile",
    "tabLearn": "Lernen",
    "tabPractice": "Üben",
    "calculatorTitle": "Bijektiver Mathe-Rechner",
    "calculatorDesc": "Geben Sie zwei bijektive Basis-6-Zahlen ein, um die Ergebnisse für alle Standard-Rechenoperationen zu sehen.",
    "num1Placeholder": "Erste Zahl",
    "num2Placeholder": "Zweite Zahl",
    "calculateBtn": "Berechnen",
    "resultsTitle": "Ergebnisse",
    "liveConverterTitle": "Live-Zahlensystem-Explorer",
    "liveConverterDesc": "Geben Sie eine Standard-Dezimalzahl ein, um ihre Echtzeit-Darstellung in verschiedenen Systemen zu sehen.",
    "decimalInputLabel": "Geben Sie eine Dezimalzahl ein:",
    "decimalInputPlaceholder": "z.B. 43",
    "additionTableTitle": "Additionstabelle (1 bis 24)",
    "multiplicationTableTitle": "Multiplikationstabelle (1 bis 24)",
    "explanationTitle": "Das bijektive System verstehen",
    "explanationDesc1": "Dieses System ist eine <strong>bijektive Zahldarstellung zur Basis 6</strong>. Es ist positionell, aber mit zwei wesentlichen Unterschieden: Es hat keine Null, und seine Ziffern reichen von 1 bis 6. Da es keine Null als Platzhalter gibt, 'rollt' das System anders über. Nach <code>6</code> ist die nächste Zahl <code>11</code>.",
    "algoTitle": "Der Konvertierungsalgorithmus erklärt",
    "algoDesc1": "Der Trick bei der Umwandlung von Dezimal in bijektive Basis 6 besteht darin, das Zahlensystem vorübergehend zu verschieben. Computer arbeiten natürlich mit Resten von 0 bis 5, aber unsere Ziffern sind 1 bis 6. Wir überbrücken diese Lücke, indem wir vor jeder Berechnung 1 subtrahieren.",
    "visualizerTitle": "Algorithmus-Visualisierer",
    "visualizerDesc": "Geben Sie eine Dezimalzahl ein, um den Konvertierungsalgorithmus in Aktion zu sehen.",
    "visualizerInputPlaceholder": "Dezimalzahl zur Visualisierung eingeben...",
    "visualizeBtn": "Visualisieren",
    "formalLangTitle": "Die Mathematik hinter der Magie: Eine Verbindung zur Theorie der formalen Sprachen",
    "formalLangDesc1": "Das bijektive Base-6-System hat eine tiefe und schöne Verbindung zur Theorie der formalen Sprachen, einem Eckpfeiler der theoretischen Informatik.",
    "formalLangDesc2": "In diesem Bereich definieren wir ein Alphabet, Sigma, als eine Menge von Symbolen. Für unser System ist das Alphabet Sigma = {1, 2, 3, 4, 5, 6}.",
    "formalLangDesc3": "Die Menge aller möglichen Zeichenketten, die mit diesem Alphabet erstellt werden können, ist als Kleene-Stern (oder Kleene-Hülle) von Sigma bekannt, bezeichnet als Sigma*. Diese Menge umfasst Zeichenketten beliebiger endlicher Länge: {leere Zeichenkette, 1, 2, ..., 6, 11, 12, ..., 66, 111, ...}.",
    "formalLangDesc4": "Das bijektive Base-6-System ist im Wesentlichen eine perfekte, geordnete Aufzählung des Kleene-Sterns des Alphabets {1, 2, 3, 4, 5, 6}, wenn wir die leere Zeichenkette der Null zuordnen. Jede positive ganze Zahl entspricht genau einer Zeichenkette, und jede Zeichenkette entspricht genau einer positiven ganzen Zahl. Dies ist unglaublich mächtig, da es eine nahtlose Möglichkeit bietet, jeder Sequenz von Ereignissen oder Entscheidungen aus einer Menge von sechs eine eindeutige Nummer zuzuweisen, eine grundlegende Operation in Algorithmen und der Berechenbarkeitstheorie.",
    "geomTitle": "Eine geometrische Interpretation: Der unendliche 6-stellige Baum",
    "geomDesc1": "Wir können das gesamte System als einen unendlichen, vollständigen 6-stelligen Baum visualisieren. Ein 6-stelliger Baum ist eine Struktur, bei der jeder Knoten genau sechs Kinder hat.",
    "geomDesc2": "Die Wurzel des Baumes kann als Ausgangspunkt betrachtet werden (der die Zahl 0 oder die leere Zeichenkette darstellt).",
    "geomList": [ "Die erste Ebene der Knoten ist mit 1, 2, 3, 4, 5 und 6 beschriftet.", "Jeder dieser Knoten hat sechs Kinder. Zum Beispiel ist der Knoten „1“ der übergeordnete Knoten der Knoten „11“, „12“, „13“, „14“, „15“ und „16“." ],
    "geomDesc4": "In diesem Modell ist jede bijektive Base-6-Zahl die eindeutige „Adresse“ oder der „Pfad“ von der Wurzel zu einem bestimmten Knoten. Zum Beispiel bedeutet die Zahl 425:",
    "geomPathList": [ "Beginnen Sie an der Wurzel.", "Nehmen Sie den 4. Zweig.", "Nehmen Sie von diesem Knoten den 2. Zweig.", "Nehmen Sie von diesem Knoten den 5. Zweig." ],
    "hashingTitle": "Ein Hinweis zu Kollisionen und Hashing",
    "hashingDesc": "Bei der Betrachtung der Multiplikationstabelle stellt man fest, dass <code>2 × 3 = 6</code> und <code>1 × 6 = 6</code> ist. Dies ist eine <strong>Kollision</strong>. Obwohl mathematisch interessant, ist diese Eigenschaft das Gegenteil von dem, was in kryptographischen Hash-Funktionen (wie SHA-256) erwünscht ist, die speziell darauf ausgelegt sein müssen, das Finden von Kollisionen rechnerisch unmöglich zu machen. Dieses System ist daher ein gutes Werkzeug, um das Konzept der Kollisionen zu verstehen, aber es ist selbst kein sicherer Hashing-Algorithmus.",
    "prosTitle": "Vorteile der bijektiven Basis 6",
    "prosIntro": "Die nulllose Natur dieses Systems bietet mehrere einzigartige Vorteile, insbesondere in der Datenverarbeitung und bei für Menschen lesbaren Bezeichnern.",
    "pros": [
        { "title": "Eindeutig & menschenfreundlich", "desc": "Keine führenden Nullen bedeuten keine Verwirrung. <code>123</code> ist immer <code>123</code>, niemals <code>0123</code>. Dies ist ideal für Produktcodes, Seriennummern oder kurze Links, bei denen Klarheit entscheidend ist." },
        { "title": "Kompakt & Effizient", "desc": "Jede mögliche Zeichenfolge von Ziffern ist eine gültige Zahl, was es zu einer sehr dichten und effizienten Art der Datendarstellung macht. Es gibt keine verschwendeten oder ungültigen Kombinationen." },
        { "title": "Natürliche Eignung für die Datenverarbeitung", "desc": "Die Eins-zu-eins-Zuordnung ist ideal für Algorithmen, die eindeutige Bezeichner benötigen, wie z.B. die Indizierung komplexer Datenstrukturen oder die Erzeugung von Schlüsseln in verteilten Systemen." },
        { "title": "Eliminierung von Null-Referenzen (Eine theoretische Idee)", "desc": "Sie haben gefragt, ob ein auf diesem System aufgebauter Computer Nullzeiger hätte. Im theoretischen Sinne sind Sie auf etwas Tiefgründiges gestoßen! Da es keine „Null“ gibt, um „nichts“ oder einen nicht initialisierten Zustand darzustellen, bezieht sich jede mögliche Ziffernfolge auf eine gültige, eindeutige Zahl. Dies passt wunderbar zur Idee der Eliminierung von Null-Referenzen, einer häufigen Fehlerquelle in der Programmierung." },
        { "title": "Höheres Zählen mit den Fingern", "desc": "Mit zehn Fingern kann man weit über 10 hinaus zählen. Jede Hand kann eine bijektive Ziffer zur Basis 6 darstellen (1-5 Finger oder eine geschlossene Faust für 6). Mit zwei Händen können Sie jede Zahl von 1 bis 42 darstellen, wobei ein Finger an der linken und ein Finger an der rechten Hand 7 (bijektiv 11) bedeutet." }
    ],
    "consTitle": "Nachteile und Kompromisse",
    "consIntro": "Obwohl leistungsstark, wird das System aus einigen wichtigen Gründen nicht für die allgemeine Arithmetik verwendet.",
    "cons": [
        { "title": "Ungewohnte Arithmetik", "desc": "Die Regeln für den Übertrag beim Addieren und Subtrahieren unterscheiden sich vom Dezimalsystem, was Kopfrechnen und manuelle Berechnungen für die meisten Menschen zu einer Herausforderung macht." },
        { "title": "Konvertierungsaufwand", "desc": "Es ist kein natives System für Computer (die binär verwenden) oder Menschen (die dezimal verwenden). Ein Konvertierungsschritt ist immer erforderlich, wenn mit anderen Systemen interagiert wird, was zusätzlichen Rechenaufwand bedeutet." },
        { "title": "Begrenzte native Unterstützung", "desc": "Sehr wenige Programmiersprachen oder Standardbibliotheken haben eingebaute Funktionen für die bijektive Zählung. Das bedeutet, dass Entwickler benutzerdefinierte Logik für alle arithmetischen und Konvertierungsoperationen implementieren müssen." },
        { "title": "Komplexe Multiplikationsmuster", "desc": "Im Gegensatz zu Standardbasen, bei denen die Multiplikation mit der Basis einfach eine Null hinzufügt, sind die Muster bei der bijektiven Multiplikation weniger intuitiv, was schnelle Schätzungen oder Berechnungen erschwert." }
    ],
    "practiceTitle": "Übungsmodus",
    "practiceDesc": "Testen Sie Ihre Fähigkeiten gegen die Uhr! Wählen Sie einen Schwierigkeitsgrad und lösen Sie die Aufgaben.",
    "difficultyLabel": "Schwierigkeit:",
    "difficultyEasy": "Leicht",
    "difficultyMedium": "Mittel",
    "difficultyHard": "Schwer",
    "quizQuestion": "Was ist",
    "quizTypeConversion": "Umwandlung",
    "quizTypeMath": "Mathe",
    "quizQuestionConversionSuffix": "in bijektiver Base-6?",
    "quizAnswerPlaceholder": "Ihre Antwort...",
    "quizSubmitBtn": "Senden",
    "quizCorrectFeedback": "Richtig! 🎉",
    "quizIncorrectFeedback": "Nicht ganz! Die richtige Antwort war",
    "quizNextBtn": "Nächste Frage",
    "timeLabel": "Zeit:",
    "githubLink": "Projekt-Quellcode verfügbar auf",
    "licenseLink": "Veröffentlicht unter der",
    "ui_loading": "Wird geladen...",
    "errorBothNumbers": "Bitte geben Sie beide Nummern ein.",
    "errorGeneric": "Fehler:"
}
