{
    "pageTitle": "Bijektiver Base-6 Rechner & Explorer",
    "pageDescription": "Ein interaktives Lehrmittel zum Berechnen und Erforschen des bijektiven Zahlensystems zur Basis 6, das keine Null hat.",
    "themeSwitcherLabel": "Thema umschalten",
    "mainTitle": "Bijektiver Base-6 Rechner & Explorer",
    "tabCalculator": "Rechner & Explorer",
    "tabTables": "Referenztabellen",
    "tabExplanations": "Erklärungen",
    "calculatorTitle": "Bijektiver Mathe-Rechner",
    "calculatorDesc": "Geben Sie zwei bijektive Basis-6-Zahlen ein, um die Ergebnisse für alle Operationen zu sehen.",
    "num1Placeholder": "Erste Zahl",
    "num2Placeholder": "Zweite Zahl",
    "calculateBtn": "Alle Operationen berechnen",
    "resultsTitle": "Ergebnisse",
    "additionTableTitle": "Additionstabelle (1-12)",
    "multiplicationTableTitle": "Multiplikationstabelle (1-12)",
    "primerTitle": "Warum ein Zahlensystem ohne Null verwenden?",
    "primerDesc1": "In unserem standardmäßigen Dezimalsystem ist die Null ein Platzhalter. Das kann jedoch Probleme verursachen: Ist <code>007</code> dasselbe wie <code>7</code>? In der bijektiven Zählung verschwinden diese Probleme. Jede Zahl hat genau eine eindeutige Darstellung, was sie perfekt für IDs und Codes macht.",
    "primerDesc2": "Ein lustiger Nebeneffekt: Mit einem bijektiven System zur Basis 6 können Sie auf zwei Händen höher als 10 zählen. Jede Hand stellt eine Ziffer dar (1-6). Die Zahl 11 (bijektiv) ist 7 (dezimal), dargestellt durch einen Finger an einer Hand und einen an der anderen. Sie können auf diese Weise bis zu <strong>42</strong> (66 in bijektiv) zählen!",
    "explanationTitle": "Was ist die bijektive Basis 6?",
    "explanationDesc1": "Es ist ein Positionssystem, das die Ziffern <strong>1, 2, 3, 4, 5, 6</strong> verwendet. Nach <code>6</code> wird die Sequenz mit <code>11</code>, <code>12</code> usw. fortgesetzt, genau wie bei Tabellenkalkulationsspalten (A-Z, dann AA). Diese Eins-zu-Eins-Zuordnung (eine \"Bijektion\") zwischen Zahlen und ihren Zeichenkettendarstellungen ist ihr Hauptmerkmal.",
    "algoTitle": "Der Konvertierungsalgorithmus erklärt",
    "algoDesc1": "Der Trick bei der Umwandlung von Dezimalzahlen besteht darin, das Zahlensystem vorübergehend zu verschieben. Computer verwenden Reste von 0-5, aber unsere Ziffern sind 1-6. Wir überbrücken diese Lücke, indem wir vor jeder Berechnung 1 subtrahieren.",
    "algoExampleTitle": "Lassen Sie uns die Dezimalzahl <strong>43</strong> umwandeln:",
    "algoStep1": "<strong>Schritt 1:</strong> <code>(43 - 1) % 6 = 0</code>. Die 0. Ziffer in <code>&quot;123456&quot;</code> ist \'1\'. Ergebnis: <strong>1</strong>. Nächste Zahl: <code>floor((43 - 1) / 6) = 7</code>.",
    "algoStep2": "<strong>Schritt 2:</strong> <code>(7 - 1) % 6 = 0</code>. Die 0. Ziffer ist \'1\'. Ergebnis: <strong>11</strong>. Nächste Zahl: <code>floor((7 - 1) / 6) = 1</code>.",
    "algoStep3": "<strong>Schritt 3:</strong> <code>(1 - 1) % 6 = 0</code>. Die 0. Ziffer ist \'1\'. Ergebnis: <strong>111</strong>. Nächste Zahl: <code>floor((1 - 1) / 6) = 0</code>.",
    "algoResult": "Der Vorgang stoppt. Das Endergebnis ist <code>111</code>.",
    "applicationsTitle": "Wichtige Vorteile & Anwendungen",
    "appUnambiguous": "<strong>Eindeutig & benutzerfreundlich:</strong> Perfekt für Produktcodes, Seriennummern oder URL-Verkürzer, die niemals aufgrund einer fehlenden oder zusätzlichen Null falsch eingegeben werden können.",
    "appCompact": "<strong>Kompakt, aber lesbar:</strong> Kompakter als binär, aber für Menschen oft auf einen Blick leichter zu analysieren als hexadezimal.",
    "appCrypto": "<strong>Natürliche Eignung für die Kryptographie:</strong> Garantiert Eins-zu-Eins-Zuordnungen (kanonische Darstellung), was entscheidend ist, um subtile Fehler und Sicherheitslücken bei der Datenserialisierung und in kryptographischen Systemen zu verhindern. In einem theoretischen Computer, der auf diesem System aufgebaut ist, würde die klassische 'Null-Pointer-Exception' (ein Fehler beim Zugriff auf Adresse 0) nicht in der gleichen Weise existieren, da die erste Adresse 1 ist.",
    "darkSecretTitle": "Das dunkelste Geheimnis einer Welt ohne Null",
    "darkSecretDesc": "Das Fehlen der Null ist nicht nur eine Kuriosität; es hat tiefgreifende philosophische Implikationen. In unserer Mathematik repräsentiert die Null sowohl eine Menge (nichts) als auch ein Konzept (den Ursprung). Ein bijektives System hat kein Symbol für das Nichts. Die Zahl Null wird durch die leere Zeichenfolge dargestellt – das Fehlen von Symbolen. Dies impliziert ein Universum, in dem das Konzept des 'Nichts' kein darzustellender Zustand ist, sondern eine wahre Leere. In der Informatik bedeutet dies, dass es keine 'Null'-Adresse gibt, was potenziell eine ganze Klasse gängiger Programmierfehler auf fundamentaler Ebene beseitigt.",
    "donationBtn": "Dieses Projekt unterstützen",
    "githubLink": "Projekt-Quellcode verfügbar auf",
    "licenseLink": "Veröffentlicht unter der"
}
