{
    "pageTitle": "Bijective Base-6 Calculator & Explorer",
    "pageDescription": "An interactive educational tool to calculate and explore the bijective base-6 number system, which has no zero. Features a live converter and reference tables.",
    "themeSwitcherLabel": "Toggle theme",
    "mainTitle": "Bijective Base-6 Calculator & Explorer",
    "tabCalculator": "Calculator & Explorer",
    "tabTables": "Reference Tables",
    "tabExplanations": "Explanations",
    "liveConverterTitle": "Live Conversion Explorer",
    "liveConverterDesc": "Enter a decimal number to see its real-time representation across different systems.",
    "decimalInputLabel": "Enter a Decimal Number:",
    "decimalInputPlaceholder": "e.g., 25",
    "calculatorTitle": "Bijective Math Calculator",
    "calculatorDesc": "Enter two bijective base-6 numbers to see the results for all operations.",
    "num1Placeholder": "First number",
    "num2Placeholder": "Second number",
    "calculateBtn": "Calculate All Operations",
    "resultsTitle": "Results",
    "quizTitle": "Bijective Explorer (Practice Mode)",
    "quizDesc": "Test your skills! Solve the problem and see if you've mastered the system.",
    "quizQuestion": "What is {problem} in bijective base-6?",
    "quizAnswerPlaceholder": "Answer...",
    "quizSubmitBtn": "Submit",
    "quizCorrect": "Correct! 🎉",
    "quizIncorrect": "Not quite! The correct answer was <strong>{answer}</strong>.",
    "quizNextBtn": "Next Question",
    "additionTableTitle": "Addition Table (1 to 12)",
    "multiplicationTableTitle": "Multiplication Table (1 to 12)",
    "primerTitle": "A Primer on Numerical Systems",
    "primerDesc1": "Most number systems we use are <strong>positional</strong>. This means the value of a digit depends on its position within a number. The \"base\" of a system tells us how many unique digits are used. The value of each position is an exponent of the base, starting from 0 on the right.",
    "primerDesc2": "In these standard systems, the digit <strong>zero</strong> is essential. It is not just a number, but a fundamental <strong>placeholder</strong>. It signifies an empty position, like the tens place in <code>101</code>. The bijective system you are exploring is fascinating because it works without this placeholder.",
    "explanationTitle": "Understanding the Bijective System",
    "explanationDesc1": "This system is a <strong>bijective base-6 numeration</strong>. It is positional, but with two key differences: it has no zero, and its digits run from 1 to 6. Because there is no zero to act as a placeholder, the system \"rolls over\" differently. After <code>6</code>, the next number is <code>11</code>.",
    "algoTitle": "The Conversion Algorithm Explained",
    "algoDesc1": "The trick to converting from decimal to bijective base-6 is to temporarily shift the number system. Computers naturally work with remainders from 0 to 5, but our digits are 1 to 6. We bridge this gap by subtracting 1 before each calculation.",
    "algoExampleTitle": "Let's convert the decimal number <strong>43</strong>:",
    "algoStep1": "<strong>Step 1:</strong> Start with 43. Subtract 1: <code>43 - 1 = 42</code>. Now, find the remainder when dividing by 6. <code>42 % 6 = 0</code>. The 0th digit in our character set <code>\"123456\"</code> is '1'. Our first result digit is <strong>1</strong>. The new number for the next step is <code>(42 - 0) / 6 = 7</code>.",
    "algoStep2": "<strong>Step 2:</strong> Start with 7. Subtract 1: <code>7 - 1 = 6</code>. Now, find the remainder. <code>6 % 6 = 0</code>. The 0th digit is again '1'. Our second result digit is <strong>1</strong>. The new number is <code>(6 - 0) / 6 = 1</code>.",
    "algoStep3": "<strong>Step 3:</strong> Start with 1. Subtract 1: <code>1 - 1 = 0</code>. Now, find the remainder. <code>0 % 6 = 0</code>. The 0th digit is again '1'. Our third result digit is <strong>1</strong>. The new number is <code>(0 - 0) / 6 = 0</code>.",
    "algoResult": "Reversing the digits gives <code>111</code>. Thus, 43 in decimal is 111 in bijective base-6.",
    "applicationsTitle": "Practical Applications",
    "appDesc1": "Bijective numeration is more than a curiosity; it solves real-world problems in computer science.",
    "appSpreadsheet": "<strong>Spreadsheet Columns:</strong> Microsoft Excel and Google Sheets use a bijective base-26 system (A-Z) for columns. After Z comes AA, then AB, AC, and so on. This is a perfect, intuitive real-world example where there is no \"zeroth\" column.",
    "appUrl": "<strong>URL Shorteners:</strong> Services like bit.ly need to create the shortest possible unique string for billions of links. A bijective base-62 system (<code>a-z, A-Z, 0-9</code>) can represent a massive database ID like <code>2,183,401,055,849</code> as the short, clean string <code>`short`</code>.",
    "advancedTitle": "Deeper Mathematical Connections",
    "advFactorizationTitle": "A Note on 'Composite' Digits and Factorization",
    "advFactorizationDesc": "An astute observer of the multiplication table will notice something curious: <code>2 × 3 = 6</code>, but also <code>1 × 6 = 6</code>. In our standard number system, the number 6 has a unique prime factorization (2 and 3). However, in the bijective system, <strong>the digit <code>6</code> itself acts like a composite number</strong>. The digits <code>1, 2, 3, 4, 5</code> are the \"primes\" of this single-digit world. This reveals a deep property: the set of single digits in a bijective system does not form a <a href=\"https://en.wikipedia.org/wiki/Unique_factorization_domain\" target=\"_blank\">Unique Factorization Domain</a>. This is a direct consequence of using the base `k` as a digit instead of `0`. It doesn't break the system; rather, it highlights its unique algebraic structure.",
    "advFormalLangTitle": "Connection to Formal Language Theory",
    "advFormalLangDesc": "The bijective base-6 system has a beautiful connection to theoretical computer science. If we define an alphabet of symbols, Σ (Sigma), as our set of digits <code>{1, 2, 3, 4, 5, 6}</code>, then the set of all possible finite strings you can create with these symbols is called the Kleene Star, denoted Σ*. This set includes <code>{ε, 1, 2, ..., 6, 11, 12, ...}</code>, where ε is the empty string. The bijective system is a perfect, ordered enumeration of this set, providing a seamless way to assign a unique integer to any sequence of choices from our set of six.",
    "advGeoTitle": "Geometric Interpretation: The Infinite Tree",
    "advGeoDesc": "We can visualize the entire system as an infinite, complete 6-ary tree, where every node has exactly six children. The root of the tree represents a starting point. The first level of nodes are labeled 1 through 6. Each of those nodes is the parent of six more nodes. For example, node \"2\" is the parent of nodes \"21\", \"22\", \"23\", \"24\", \"25\", and \"26\". In this model, every bijective base-6 number is the unique \"address\" or path from the root to a specific node.",
    "donationBtn": "Support this Project",
    "githubLink": "Project source available on",
    "licenseLink": "Released under the"
}
