{
    "pageTitle": "Bijective Base-6 Calculator & Explorer",
    "pageDescription": "An interactive educational tool to calculate and explore the bijective base-6 number system, which has no zero. Features a live converter and reference tables.",
    "mainTitle": "Bijective Base-6 Calculator & Explorer",
    "tabCalculator": "Calculator & Explorer",
    "tabTables": "Reference Tables",
    "tabExplanations": "Explanations",
    "liveConverterTitle": "Live Conversion Explorer",
    "liveConverterDesc": "Enter a decimal number to see its real-time representation across different systems.",
    "decimalInputLabel": "Enter a Decimal Number:",
    "calculatorTitle": "Bijective Math Calculator",
    "calculatorDesc": "Enter two bijective base-6 numbers to see the results for all operations.",
    "num1Placeholder": "First number",
    "num2Placeholder": "Second number",
    "calculateBtn": "Calculate All Operations",
    "resultsTitle": "Results",
    "additionTableTitle": "Addition Table (1 to 12)",
    "multiplicationTableTitle": "Multiplication Table (1 to 12)",
    "primerTitle": "A Primer on Numerical Systems",
    "primerDesc1": "Most number systems we use are <strong>positional</strong>. This means the value of a digit depends on its position within a number. The \"base\" of a system tells us how many unique digits are used. The value of each position is an exponent of the base, starting from 0 on the right.",
    "primerDesc2": "In these standard systems, the digit <strong>zero</strong> is essential. It is not just a number, but a fundamental <strong>placeholder</strong>. It signifies an empty position, like the tens place in <code>101</code>. The bijective system you are exploring is fascinating because it works without this placeholder.",
    "explanationTitle": "Understanding the Bijective System",
    "explanationDesc1": "This system is a <strong>bijective base-6 numeration</strong>. It is positional, but with two key differences: it has no zero, and its digits run from 1 to 6. Because there is no zero to act as a placeholder, the system \"rolls over\" differently. After <code>6</code>, the next number is <code>11</code>.",
    "algoTitle": "The Conversion Algorithm Explained",
    "algoDesc": "The trick to converting from decimal to bijective base-6 is to temporarily shift the number system. Computers naturally work with remainders from 0 to 5, but our digits are 1 to 6. We bridge this gap by subtracting 1 before each calculation.",
    "applicationsTitle": "Practical Applications",
    "applicationsDesc": "Bijective numeration is more than a curiosity; it solves real-world problems in computer science.",
    "advancedTitle": "Deeper Mathematical Connections",
    "advancedDesc": "The properties of bijective numeration extend into more complex areas of computer science and mathematics, such as cryptography and algorithmic enumeration.",
    "donationBtn": "Support this Project",
    "githubLink": "Project source available on",
    "licenseLink": "Released under the"
}
