{
    "pageTitle": "Bijective Base-6 Calculator & Explorer",
    "pageDescription": "An interactive educational tool to calculate and explore the bijective base-6 number system, which has no zero. Features a live converter and reference tables.",
    "themeSwitcherLabel": "Toggle theme",
    "mainTitle": "Bijective Base-6 Calculator & Explorer",
    "tabCalculator": "Calculator & Explorer",
    "tabTables": "Reference Tables",
    "tabExplanations": "Explanations",
    "liveConverterTitle": "Live Conversion Explorer",
    "liveConverterDesc": "Enter a decimal number to see its real-time representation across different systems.",
    "decimalInputLabel": "Enter a Decimal Number:",
    "decimalInputPlaceholder": "e.g., 25",
    "calculatorTitle": "Bijective Math Calculator",
    "calculatorDesc": "Enter two bijective base-6 numbers to see the results for all operations.",
    "num1Placeholder": "First number",
    "num2Placeholder": "Second number",
    "calculateBtn": "Calculate All Operations",
    "resultsTitle": "Results",
    "additionTableTitle": "Addition Table (1 to 12)",
    "multiplicationTableTitle": "Multiplication Table (1 to 12)",
    "primerTitle": "A Primer on Numerical Systems",
    "primerDesc1": "Most number systems we use are <strong>positional</strong>. This means the value of a digit depends on its position within a number. The \"base\" of a system tells us how many unique digits are used.",
    "primerDesc2": "In these standard systems, the digit <strong>zero</strong> is essential as a <strong>placeholder</strong>. It signifies an empty position, like the tens place in <code>101</code>. The bijective system is fascinating because it works without this.",
    "explanationTitle": "Understanding the Bijective System",
    "explanationDesc1": "This system is a <strong>bijective base-6 numeration</strong>. It is positional, but with two key differences: it has no zero, and its digits run from 1 to 6. Because there is no zero, the system \"rolls over\" differently. After <code>6</code>, the next number is <code>11</code>.",
    "fingerCountingTitle": "A Practical Advantage: Counting Higher on 10 Fingers",
    "fingerCountingDesc": "With standard base-10, you can count from 0 to 9. With a bijective system, you can assign values 1-10 to your fingers. By representing numbers as sequences of finger states (up/down), you can count much higher. Using a bijective base-2 (digits 1, 2), you could count to <code>2^10 - 1 = 1023</code>. This shows the power of representing every position with a meaningful value.",
    "algoTitle": "The Conversion Algorithm Explained",
    "algoDesc1": "The trick to converting from decimal is to temporarily shift the number system. Computers use remainders from 0-5, but our digits are 1-6. We bridge this gap by subtracting 1 before each calculation.",
    "algoExampleTitle": "Let's convert the decimal number <strong>43</strong>:",
    "algoStep1": "<strong>Step 1:</strong> Start with 43. Calculate <code>(43 - 1) % 6 = 0</code>. The 0th digit in our character set <code>\\\"123456\\\"</code> is '1'. The new number is <code>(43 - 1) / 6 = 7</code>.",
    "algoStep2": "<strong>Step 2:</strong> Start with 7. Calculate <code>(7 - 1) % 6 = 0</code>. The 0th digit is again '1'. The new number is <code>(7 - 1) / 6 = 1</code>.",
    "algoStep3": "<strong>Step 3:</strong> Start with 1. Calculate <code>(1 - 1) % 6 = 0</code>. The 0th digit is again '1'. The new number is <code>(1 - 1) / 6 = 0</code>.",
    "algoResult": "Reversing the digits gives <code>111</code>. Thus, 43 in decimal is 111 in bijective base-6.",
    "applicationsTitle": "Practical Applications",
    "appDesc1": "Bijective numeration is more than a curiosity; it solves real-world problems in computer science.",
    "appSpreadsheet": "<strong>Spreadsheet Columns:</strong> Microsoft Excel and Google Sheets use a bijective base-26 system (A-Z). After Z comes AA, then AB. This is a perfect real-world example where there is no \"zeroth\" column.",
    "appUrl": "<strong>URL Shorteners:</strong> Services like bit.ly use a bijective base-62 system (<code>a-z, A-Z, 0-9</code>) to map massive database IDs to short, unique, and readable strings.",
    "advancedTitle": "Deeper Mathematical Connections",
    "advFactorizationTitle": "A Note on 'Composite' Digits and Factorization",
    "advFactorizationDesc": "An astute observer of the multiplication table will notice that <code>2 × 3 = 6</code>, but also <code>1 × 6 = 6</code>. In our standard system, 6 has a unique prime factorization (2 and 3). However, in the bijective system, <strong>the digit <code>6</code> itself acts like a composite number</strong>. The digits <code>1, 2, 3, 4, 5</code> are the \"primes\" of this single-digit world. This reveals that the set of single digits does not form a <a href=\"https://en.wikipedia.org/wiki/Unique_factorization_domain\" target=\"_blank\">Unique Factorization Domain</a>, a direct consequence of using the base `k` as a digit instead of `0`.",
    "advFormalLangTitle": "Connection to Formal Language Theory",
    "advFormalLangDesc": "The bijective base-6 system has a beautiful connection to theoretical computer science. If we define an alphabet, Σ, as our set of digits <code>{1, 2, 3, 4, 5, 6}</code>, the set of all possible finite strings is called the Kleene Star, Σ*. The bijective system is a perfect, ordered enumeration of this set, providing a seamless way to assign a unique integer to any sequence of choices from our set of six.",
    "advGeoTitle": "Geometric Interpretation: The Infinite Tree",
    "advGeoDesc": "We can visualize the entire system as an infinite, complete 6-ary tree, where every node has exactly six children. The root represents a starting point. The first level of nodes are labeled 1 through 6. Each of those nodes is the parent of six more nodes (e.g., node \"2\" is the parent of \"21\", \"22\", etc.). In this model, every bijective number is the unique \"address\" or path from the root to a specific node.",
    "donationBtn": "Support this Project",
    "githubLink": "Project source available on",
    "licenseLink": "Released under the"
}
