{
    "pageTitle": "Calculadora y Explorador Bijective Base-6",
    "pageDescription": "Una herramienta educativa interactiva para calcular y explorar el sistema numérico biyectivo de base 6, que no tiene cero.",
    "themeSwitcherLabel": "Cambiar tema",
    "mainTitle": "Calculadora y Explorador Bijective Base-6",
    "tabCalculator": "Calculadora y Explorador",
    "tabTables": "Tablas de Referencia",
    "tabExplanations": "Explicaciones",
    "calculatorTitle": "Calculadora Matemática Biyectiva",
    "calculatorDesc": "Ingrese dos números en base 6 biyectiva para ver los resultados de todas las operaciones.",
    "num1Placeholder": "Primer número",
    "num2Placeholder": "Segundo número",
    "calculateBtn": "Calcular Todas las Operaciones",
    "resultsTitle": "Resultados",
    "additionTableTitle": "Tabla de Sumar (1-12)",
    "multiplicationTableTitle": "Tabla de Multiplicar (1-12)",
    "primerTitle": "¿Por qué usar un sistema numérico sin cero?",
    "primerDesc1": "En nuestro sistema decimal estándar, el cero es un marcador de posición. Pero esto puede causar problemas: ¿es <code>007</code> lo mismo que <code>7</code>? En la numeración biyectiva, estos problemas desaparecen. Cada número tiene exactamente una representación única, lo que lo hace perfecto para identificaciones y códigos.",
    "primerDesc2": "Un efecto secundario divertido: con un sistema biyectivo de base 6, puedes contar más de 10 con dos manos. Cada mano representa un dígito (1-6). El número 11 (biyectivo) es 7 (decimal), representado por un dedo en una mano y uno en la otra. ¡Puedes contar hasta <strong>42</strong> (66 en biyectivo) de esta manera!",
    "explanationTitle": "¿Qué es la Base 6 Biyectiva?",
    "explanationDesc1": "Es un sistema posicional que usa los dígitos <strong>1, 2, 3, 4, 5, 6</strong>. Después de <code>6</code>, la secuencia continúa con <code>11</code>, <code>12</code>, etc., al igual que las columnas de una hoja de cálculo (A-Z, luego AA). Este mapeo uno a uno (una 'biyección') entre los números y sus representaciones de cadena es su característica clave.",
    "algoTitle": "Explicación del Algoritmo de Conversión",
    "algoDesc1": "El truco para convertir de decimal es cambiar temporalmente el sistema numérico. Las computadoras usan restos de 0 a 5, pero nuestros dígitos son de 1 a 6. Salvamos esta brecha restando 1 antes de cada cálculo.",
    "algoExampleTitle": "Convirtamos el número decimal <strong>43</strong>:",
    "algoStep1": "<strong>Paso 1:</strong> <code>(43 - 1) % 6 = 0</code>. El 0º dígito en <code>&quot;123456&quot;</code> es '1'. Resultado: <strong>1</strong>. Siguiente número: <code>floor((43 - 1) / 6) = 7</code>.",
    "algoStep2": "<strong>Paso 2:</strong> <code>(7 - 1) % 6 = 0</code>. El 0º dígito es '1'. Resultado: <strong>11</strong>. Siguiente número: <code>floor((7 - 1) / 6) = 1</code>.",
    "algoStep3": "<strong>Paso 3:</strong> <code>(1 - 1) % 6 = 0</code>. El 0º dígito es '1'. Resultado: <strong>111</strong>. Siguiente número: <code>floor((1 - 1) / 6) = 0</code>.",
    "algoResult": "El proceso se detiene. El resultado final es <code>111</code>.",
    "applicationsTitle": "Beneficios y Aplicaciones Clave",
    "appUnambiguous": "<strong>Sin ambigüedades y fácil de usar:</strong> Perfecto para códigos de productos, números de serie o acortadores de URL que nunca pueden ser mal escritos por un cero faltante o extra.",
    "appCompact": "<strong>Compacto pero legible:</strong> Más compacto que el binario pero a menudo más fácil de analizar para los humanos de un vistazo que el hexadecimal.",
    "appCrypto": "<strong>Ajuste natural para la criptografía:</strong> Garantiza mapeos uno a uno (representación canónica), lo cual es crítico para prevenir errores sutiles y vulnerabilidades de seguridad. En una computadora teórica construida sobre este sistema, la clásica 'excepción de puntero nulo' (un error al acceder a la dirección 0) no existiría de la misma manera, ya que la primera dirección es 1.",
    "darkSecretTitle": "El Secreto Más Oscuro de un Mundo Sin Cero",
    "darkSecretDesc": "La ausencia de cero no es solo una curiosidad; tiene profundas implicaciones filosóficas. En nuestras matemáticas, el cero representa tanto una cantidad (nada) como un concepto (el origen). Un sistema biyectivo no tiene símbolo para la nada. El número cero se representa con la cadena vacía, la ausencia de símbolos. Esto implica un universo donde el concepto de 'nada' no es un estado a representar, sino un verdadero vacío. En computación, esto significa que no hay una dirección 'nula', eliminando potencialmente toda una clase de errores de programación comunes a un nivel fundamental.",
    "donationBtn": "Apoya este Proyecto",
    "githubLink": "Código fuente disponible en",
    "licenseLink": "Publicado bajo la licencia"
}
