{
    "pageTitle": "Calculadora y Explorador Bijective Base-6",
    "pageDescription": "Una herramienta educativa interactiva para calcular y explorar el sistema numérico biyectivo de base 6, que no tiene cero. Incluye un convertidor en tiempo real y tablas de referencia.",
    "themeSwitcherLabel": "Cambiar tema",
    "mainTitle": "Calculadora y Explorador Bijective Base-6",
    "tabCalculator": "Calculadora y Explorador",
    "tabTables": "Tablas de Referencia",
    "tabExplanations": "Explicaciones",
    "liveConverterTitle": "Explorador de Conversión en Vivo",
    "liveConverterDesc": "Ingrese un número decimal para ver su representación en diferentes sistemas en tiempo real.",
    "decimalInputLabel": "Ingrese un número decimal:",
    "decimalInputPlaceholder": "ej., 25",
    "calculatorTitle": "Calculadora Matemática Biyectiva",
    "calculatorDesc": "Ingrese dos números en base 6 biyectiva para ver los resultados de todas las operaciones matemáticas estándar.",
    "num1Placeholder": "Primer número",
    "num2Placeholder": "Segundo número",
    "calculateBtn": "Calcular Todas las Operaciones",
    "resultsTitle": "Resultados",
    "additionTableTitle": "Tabla de Sumar (1 a 12)",
    "multiplicationTableTitle": "Tabla de Multiplicar (1 a 12)",
    "primerTitle": "Introducción a los Sistemas Numéricos",
    "primerDesc1": "La mayoría de los sistemas numéricos que usamos son <strong>posicionales</strong>. Esto significa que el valor de un dígito depende de su posición dentro de un número. La \"base\" de un sistema nos dice cuántos dígitos únicos se utilizan.",
    "primerDesc2": "En estos sistemas estándar, el dígito <strong>cero</strong> es esencial como <strong>marcador de posición</strong>. Significa una posición vacía, como el lugar de las decenas en <code>101</code>. El sistema biyectivo que estás explorando es fascinante porque funciona sin este.",
    "explanationTitle": "Entendiendo el Sistema Biyectivo",
    "explanationDesc1": "Este sistema es una <strong>numeración biyectiva de base 6</strong>. Es posicional, pero no tiene cero; los dígitos son <strong>1, 2, 3, 4, 5, 6</strong>. Como no hay cero, el sistema \"da la vuelta\" de manera diferente. Después de <code>6</code>, el siguiente número es <code>11</code>.",
    "algoTitle": "Explicación del Algoritmo de Conversión",
    "algoDesc1": "El truco para convertir de decimal a base 6 biyectiva es cambiar temporalmente el sistema numérico. Las computadoras trabajan naturalmente con restos de 0 a 5, pero nuestros dígitos son de 1 a 6. Salvamos esta brecha restando 1 antes de cada cálculo.",
    "algoExampleTitle": "Convirtamos el número decimal <strong>43</strong>:",
    "algoSteps": [
        "<strong>Paso 1:</strong> <code>(43 - 1) % 6 = 0</code>. El 0º dígito en <code>\\\"123456\\\"</code> es \'1\'. Resultado: <strong>1</strong>. Siguiente número: <code>(43 - 1) / 6 = 7</code>.",
        "<strong>Paso 2:</strong> <code>(7 - 1) % 6 = 0</code>. El 0º dígito es \'1\'. Resultado: <strong>1</strong>. Siguiente número: <code>(7 - 1) / 6 = 1</code>.",
        "<strong>Paso 3:</strong> <code>(1 - 1) % 6 = 0</code>. El 0º dígito es \'1\'. Resultado: <strong>1</strong>. Siguiente número: <code>(1 - 1) / 6 = 0</code>."
    ],
    "algoResult": "Invirtiendo los dígitos se obtiene <code>111</code>. Por lo tanto, 43 en decimal es 111 en base 6 biyectiva.",
    "applicationsTitle": "Aplicaciones Prácticas",
    "appDesc1": "La numeración biyectiva es más que una curiosidad matemática; resuelve problemas del mundo real en la informática.",
    "appList": [
        "<strong>Columnas de Hojas de Cálculo:</strong> Microsoft Excel y Google Sheets usan un sistema biyectivo de base 26 (A-Z). Después de Z viene AA, luego AB. Este es un ejemplo perfecto del mundo real donde no hay una columna \"cero\".",
        "<strong>Acortadores de URL:</strong> Servicios como bit.ly usan un sistema biyectivo de base 62 (<code>a-z, A-Z, 0-9</code>) para mapear IDs de bases de datos masivas a cadenas cortas, únicas y legibles.",
        "<strong>Contar con los Dedos:</strong> Con diez dedos, puedes contar hasta 10 en decimal. ¡Pero en un sistema biyectivo, puedes llegar mucho más alto! Si cada dedo puede estar levantado (1) o bajado (2), tienes un sistema biyectivo de base 2. Con 10 dedos, puedes representar 2¹⁰ = 1024 números. Esto muestra el poder de la representación densa y sin cero."
    ],
    "advancedTitle": "Conexiones Matemáticas Más Profundas",
    "advFactorizationTitle": "Una Nota sobre Dígitos \"Compuestos\" y Factorización",
    "advFactorizationDesc": "Un observador astuto de la tabla de multiplicar notará que <code>2 × 3 = 6</code>, pero también <code>1 × 6 = 6</code>. En nuestro sistema estándar, 6 tiene una factorización prima única (2 y 3). Sin embargo, en el sistema biyectivo, <strong>el dígito <code>6</code> mismo actúa como un número compuesto</strong>. Los dígitos <code>1, 2, 3, 4, 5</code> son los \"primos\" de este mundo de un solo dígito. Esto revela que el conjunto de dígitos individuales no forma un <a href=\"https://en.wikipedia.org/wiki/Unique_factorization_domain\" target=\"_blank\">Dominio de Factorización Única</a>, una consecuencia directa de usar la base `k` como un dígito en lugar de `0`.",
    "advFormalLangTitle": "Conexión con la Teoría de Lenguajes Formales",
    "advFormalLangDesc": "El sistema biyectivo de base 6 tiene una hermosa conexión con la informática teórica. Si definimos un alfabeto, Σ, como nuestro conjunto de dígitos <code>{1, 2, 3, 4, 5, 6}</code>, entonces el conjunto de todas las posibles cadenas finitas (la Estrella de Kleene, Σ*) puede ser perfectamente enumerado por los enteros positivos. Esto proporciona una forma fluida de asignar un número único a cualquier secuencia de elecciones de un conjunto de seis.",
    "advGeoTitle": "Interpretación Geométrica: El Árbol Infinito",
    "advGeoDesc": "Podemos visualizar el sistema como un árbol 6-ario infinito y completo, donde cada nodo tiene seis hijos. Cada número biyectivo de base 6 es la \"dirección\" o ruta única desde la raíz hasta un nodo específico. El número <code>425</code> significa: comenzar en la raíz, tomar la 4ª rama, luego la 2ª, y luego la 5ª. Esto es crucial para indexar datos jerárquicos donde cada parte de la dirección es una elección significativa.",
    "donationBtn": "Apoya este Proyecto",
    "githubLink": "Código fuente del proyecto disponible en",
    "licenseLink": "Publicado bajo la"
}
