{
    "pageTitle": "Calculadora y Explorador Bijective Base-6",
    "pageDescription": "Una herramienta educativa interactiva para calcular y explorar el sistema numérico biyectivo de base 6, que no tiene cero. Incluye un convertidor en tiempo real y tablas de referencia.",
    "mainTitle": "Calculadora y Explorador Bijective Base-6",
    "tabCalculator": "Calculadora",
    "tabTables": "Tablas de Referencia",
    "tabLearn": "Aprender",
    "tabPractice": "Practicar",
    "calculatorTitle": "Calculadora Matemática Biyectiva",
    "calculatorDesc": "Ingrese dos números en base 6 biyectiva para ver los resultados de todas las operaciones matemáticas estándar.",
    "num1Placeholder": "Primer número",
    "num2Placeholder": "Segundo número",
    "calculateBtn": "Calcular",
    "resultsTitle": "Resultados",
    "liveConverterTitle": "Explorador de Sistemas Numéricos en Vivo",
    "liveConverterDesc": "Ingrese un número decimal estándar para ver su representación en tiempo real en diferentes sistemas.",
    "decimalInputLabel": "Ingrese un Número Decimal:",
    "decimalInputPlaceholder": "p.ej., 43",
    "additionTableTitle": "Tabla de Sumar (1 a 24)",
    "multiplicationTableTitle": "Tabla de Multiplicar (1 a 24)",
    "explanationTitle": "Entendiendo el Sistema Biyectivo",
    "explanationDesc1": "Este sistema es una <strong>numeración biyectiva de base 6</strong>. Es posicional, pero con dos diferencias clave: no tiene cero y sus dígitos van del 1 al 6. Como no hay cero para actuar como marcador de posición, el sistema 'da la vuelta' de manera diferente. Después de <code>6</code>, el siguiente número es <code>11</code>.",
    "algoTitle": "Explicación del Algoritmo de Conversión",
    "algoDesc1": "El truco para convertir de decimal a base 6 biyectiva es cambiar temporalmente el sistema numérico. Las computadoras trabajan naturalmente con restos de 0 a 5, pero nuestros dígitos son de 1 a 6. Salvamos esta brecha restando 1 antes de cada cálculo.",
    "visualizerTitle": "Visualizador de Algoritmo",
    "visualizerDesc": "Ingrese un número decimal para ver el algoritmo de conversión en acción.",
    "visualizerInputPlaceholder": "Ingrese decimal para visualizar...",
    "visualizeBtn": "Visualizar",
    "formalLangTitle": "La Magia Detrás de las Matemáticas: Un Vínculo con la Teoría de Lenguajes Formales",
    "formalLangDesc1": "El sistema biyectivo de base 6 tiene una profunda y hermosa conexión con la teoría de lenguajes formales, una piedra angular de la informática teórica.",
    "formalLangDesc2": "En este campo, definimos un alfabeto, Sigma, como un conjunto de símbolos. Para nuestro sistema, el alfabeto es Sigma = {1, 2, 3, 4, 5, 6}.",
    "formalLangDesc3": "El conjunto de todas las cadenas posibles que se pueden crear con este alfabeto se conoce como la estrella de Kleene (o clausura de Kleene) de Sigma, denotada como Sigma*. Este conjunto incluye cadenas de cualquier longitud finita: {cadena vacía, 1, 2, ..., 6, 11, 12, ..., 66, 111, ...}.",
    "formalLangDesc4": "El sistema biyectivo de base 6 es esencialmente una enumeración perfecta y ordenada de la estrella de Kleene del alfabeto {1, 2, 3, 4, 5, 6}, si asignamos la cadena vacía al cero. Cada entero positivo corresponde exactamente a una cadena, y cada cadena corresponde exactamente a un entero positivo. Esto es increíblemente poderoso porque proporciona una forma fluida de asignar un número único a cualquier secuencia de eventos o elecciones de un conjunto de seis, una operación fundamental en algoritmos y teoría de la computabilidad.",
    "geomTitle": "Una Interpretación Geométrica: El Árbol 6-ario Infinito",
    "geomDesc1": "Podemos visualizar todo el sistema como un árbol 6-ario infinito y completo. Un árbol 6-ario es una estructura donde cada nodo tiene exactamente seis hijos.",
    "geomDesc2": "La raíz del árbol puede considerarse como un punto de partida (que representa el número 0 o la cadena vacía).",
    "geomList": [ "El primer nivel de nodos está etiquetado como 1, 2, 3, 4, 5 y 6.", "Cada uno de esos nodos tiene seis hijos. Por ejemplo, el nodo \"1\" es el padre de los nodos \"11\", \"12\", \"13\", \"14\", \"15\" y \"16\"." ],
    "geomDesc4": "En este modelo, cada número biyectivo de base 6 es la \"dirección\" o \"ruta\" única desde la raíz hasta un nodo específico. Por ejemplo, el número 425 significa:",
    "geomPathList": [ "Comenzar en la raíz.", "Tomar la 4ª rama.", "Desde ese nodo, tomar la 2ª rama.", "Desde ese nodo, tomar la 5ª rama." ],
    "hashingTitle": "Una Nota sobre Colisiones y Hashing",
    "hashingDesc": "Al observar la tabla de multiplicar se revela que <code>2 × 3 = 6</code> y <code>1 × 6 = 6</code>. Esto es una <strong>colisión</strong>. Aunque es interesante matemáticamente, esta propiedad es lo opuesto a lo que se desea en las funciones de hash criptográficas (como SHA-256), que deben diseñarse específicamente para que encontrar colisiones sea computacionalmente inviable. Este sistema, por lo tanto, es una buena herramienta para comprender el concepto de colisiones, pero no es un algoritmo de hash seguro en sí mismo.",
    "practiceTitle": "Modo de Práctica",
    "practiceDesc": "¡Pon a prueba tus habilidades contra el reloj! Elige una dificultad y resuelve los problemas.",
    "difficultyLabel": "Dificultad:",
    "difficultyEasy": "Fácil",
    "difficultyMedium": "Medio",
    "difficultyHard": "Difícil",
    "quizQuestion": "¿Qué es",
    "quizTypeConversion": "Conversión",
    "quizTypeMath": "Matemáticas",
    "quizQuestionConversionSuffix": "en base 6 biyectiva?",
    "quizAnswerPlaceholder": "Tu respuesta...",
    "quizSubmitBtn": "Enviar",
    "quizCorrectFeedback": "¡Correcto! 🎉",
    "quizIncorrectFeedback": "¡No del todo! La respuesta correcta era",
    "quizNextBtn": "Siguiente Pregunta",
    "timeLabel": "Tiempo:",
    "donationBtn": "Apoya este Proyecto",
    "githubLink": "Código fuente del proyecto disponible en",
    "licenseLink": "Publicado bajo la",
    "ui_loading": "Cargando...",
    "errorBothNumbers": "Por favor, ingrese ambos números.",
    "errorGeneric": "Error:"
}
