{
    "pageTitle": "Calculadora y Explorador Bijective Base-6",
    "pageDescription": "Una herramienta educativa interactiva para calcular y explorar el sistema numérico biyectivo de base 6, que no tiene cero. Incluye un convertidor en tiempo real y tablas de referencia.",
    "mainTitle": "Calculadora y Explorador Bijective Base-6",
    "tabCalculator": "Calculadora y Explorador",
    "tabTables": "Tablas de Referencia",
    "tabExplanations": "Explicaciones",
    "liveConverterTitle": "Explorador de Conversión en Vivo",
    "liveConverterDesc": "Ingrese un número decimal para ver su representación en diferentes sistemas en tiempo real.",
    "decimalInputLabel": "Ingrese un número decimal:",
    "decimalInputPlaceholder": "ej., 25",
    "calculatorTitle": "Calculadora Matemática Biyectiva",
    "calculatorDesc": "Ingrese dos números en base 6 biyectiva para ver los resultados de todas las operaciones matemáticas estándar.",
    "num1Placeholder": "Primer número",
    "num2Placeholder": "Segundo número",
    "calculateBtn": "Calcular Todas las Operaciones",
    "resultsTitle": "Resultados",
    "additionTableTitle": "Tabla de Sumar (1 a 12)",
    "multiplicationTableTitle": "Tabla de Multiplicar (1 a 12)",
    "primerTitle": "Introducción a los Sistemas Numéricos",
    "primerDesc1": "La mayoría de los sistemas numéricos que usamos son <strong>posicionales</strong>. Esto significa que el valor de un dígito depende de su posición dentro de un número. La \"base\" de un sistema nos dice cuántos dígitos únicos se utilizan. El valor de cada posición es un exponente de la base, comenzando desde 0 a la derecha.",
    "primerDesc2": "En estos sistemas estándar, el dígito <strong>cero</strong> es esencial. No es solo un número, sino un <strong>marcador de posición</strong> fundamental. Significa una posición vacía, como el lugar de las decenas en <code>101</code>. El sistema biyectivo que estás explorando es fascinante porque funciona sin este marcador de posición.",
    "explanationTitle": "Entendiendo el Sistema Biyectivo",
    "explanationDesc1": "Este sistema es una <strong>numeración biyectiva de base 6</strong>. Es posicional, pero con dos diferencias clave: no tiene cero y sus dígitos van del 1 al 6. Como no hay cero para actuar como marcador de posición, el sistema \"da la vuelta\" de manera diferente. Después de <code>6</code>, el siguiente número es <code>11</code>.",
    "algoTitle": "Explicación del Algoritmo de Conversión",
    "algoDesc1": "El truco para convertir de decimal a base 6 biyectiva es cambiar temporalmente el sistema numérico. Las computadoras trabajan naturalmente con restos de 0 a 5, pero nuestros dígitos son de 1 a 6. Salvamos esta brecha restando 1 antes de cada cálculo.",
    "algoExampleTitle": "Convirtamos el número decimal <strong>43</strong>:",
    "algoStep1": "<strong>Paso 1:</strong> Comienza con 43. Resta 1: <code>43 - 1 = 42</code>. Ahora, encuentra el resto al dividir por 6. <code>42 % 6 = 0</code>. El 0º dígito en nuestro conjunto de caracteres <code>\"123456\"</code> es \'1\'. Nuestro primer dígito de resultado es <strong>1</strong>. El nuevo número para el siguiente paso es <code>(42 - 0) / 6 = 7</code>.",
    "algoStep2": "<strong>Paso 2:</strong> Comienza con 7. Resta 1: <code>7 - 1 = 6</code>. Ahora, encuentra el resto. <code>6 % 6 = 0</code>. El 0º dígito es nuevamente \'1\'. Nuestro segundo dígito de resultado es <strong>1</strong>. El nuevo número es <code>(6 - 0) / 6 = 1</code>.",
    "algoStep3": "<strong>Paso 3:</strong> Comienza con 1. Resta 1: <code>1 - 1 = 0</code>. Ahora, encuentra el resto. <code>0 % 6 = 0</code>. El 0º dígito es nuevamente \'1\'. Nuestro tercer dígito de resultado es <strong>1</strong>. El nuevo número es <code>(0 - 0) / 6 = 0</code>.",
    "algoResult": "Invirtiendo los dígitos se obtiene <code>111</code>. Por lo tanto, 43 en decimal es 111 en base 6 biyectiva.",
    "applicationsTitle": "Aplicaciones Prácticas",
    "appDesc1": "La numeración biyectiva es más que una curiosidad matemática; resuelve problemas del mundo real en la informática.",
    "appSpreadsheet": "<strong>Columnas de Hojas de Cálculo:</strong> Microsoft Excel y Google Sheets usan un sistema biyectivo de base 26 (A-Z) para las columnas. Después de Z viene AA, luego AB, AC, y así sucesivamente. Este es un ejemplo perfecto e intuitivo del mundo real donde no hay una columna \"cero\".",
    "appUrl": "<strong>Acortadores de URL:</strong> Servicios como bit.ly necesitan crear la cadena única más corta posible para miles de millones de enlaces. Un sistema biyectivo de base 62 (<code>a-z, A-Z, 0-9</code>) puede representar un ID de base de datos masivo como <code>2,183,401,055,849</code> como la cadena corta y limpia <code>`short`</code>.",
    "advancedTitle": "Conexiones Matemáticas Más Profundas",
    "advFactorizationTitle": "Una Nota sobre Dígitos \"Compuestos\" y Factorización",
    "advFactorizationDesc": "Un observador astuto de la tabla de multiplicar notará algo curioso: <code>2 × 3 = 6</code>, pero también <code>1 × 6 = 6</code>. En nuestro sistema numérico estándar, el número 6 tiene una factorización prima única (2 y 3). Sin embargo, en el sistema biyectivo, <strong>el dígito <code>6</code> mismo actúa como un número compuesto</strong>. Los dígitos <code>1, 2, 3, 4, 5</code> son los \"primos\" de este mundo de un solo dígito. Esto revela una propiedad profunda: el conjunto de dígitos individuales en un sistema biyectivo no forma un <a href=\"https://en.wikipedia.org/wiki/Unique_factorization_domain\" target=\"_blank\">Dominio de Factorización Única</a>. Esta es una consecuencia directa de usar la base `k` como un dígito en lugar de `0`. No rompe el sistema; más bien, resalta su estructura algebraica única.",
    "advFormalLangTitle": "Conexión con la Teoría de Lenguajes Formales",
    "advFormalLangDesc": "El sistema biyectivo de base 6 tiene una hermosa conexión con la informática teórica. Si definimos un alfabeto de símbolos, Σ (Sigma), como nuestro conjunto de dígitos <code>{1, 2, 3, 4, 5, 6}</code>, entonces el conjunto de todas las posibles cadenas finitas que puedes crear con estos símbolos se llama la Estrella de Kleene, denotada Σ*. Este conjunto incluye <code>{ε, 1, 2, ..., 6, 11, 12, ...}</code>, donde ε es la cadena vacía. El sistema biyectivo es una enumeración perfecta y ordenada de este conjunto, proporcionando una forma fluida de asignar un entero único a cualquier secuencia de elecciones de nuestro conjunto de seis.",
    "advGeoTitle": "Interpretación Geométrica: El Árbol Infinito",
    "advGeoDesc": "Podemos visualizar todo el sistema como un árbol 6-ario infinito y completo, donde cada nodo tiene exactamente seis hijos. La raíz del árbol representa un punto de partida. Los nodos del primer nivel están etiquetados del 1 al 6. Cada uno de esos nodos es el padre de seis nodos más. Por ejemplo, el nodo \"2\" es el padre de los nodos \"21\", \"22\", \"23\", \"24\", \"25\" y \"26\". En este modelo, cada número biyectivo de base 6 es la \"dirección\" o ruta única desde la raíz hasta un nodo específico.",
    "donationBtn": "Apoya este Proyecto",
    "githubLink": "Código fuente del proyecto disponible en",
    "licenseLink": "Publicado bajo la"
}
