{
    "pageTitle": "Calculadora y Explorador Bijective Base-6",
    "pageDescription": "Una herramienta educativa interactiva para calcular y explorar el sistema num칠rico biyectivo de base 6, que no tiene cero. Incluye un convertidor en tiempo real y tablas de referencia.",
    "mainTitle": "Calculadora y Explorador Bijective Base-6",
    "tabCalculator": "Calculadora",
    "tabTables": "Tablas de Referencia",
    "tabProsCons": "Pros y Contras",
    "tabLearn": "Aprender",
    "tabPractice": "Practicar",
    "calculatorTitle": "Calculadora Matem치tica Biyectiva",
    "calculatorDesc": "Ingrese dos n칰meros en base 6 biyectiva para ver los resultados de todas las operaciones matem치ticas est치ndar.",
    "num1Placeholder": "Primer n칰mero",
    "num2Placeholder": "Segundo n칰mero",
    "calculateBtn": "Calcular",
    "resultsTitle": "Resultados",
    "liveConverterTitle": "Explorador de Sistemas Num칠ricos en Vivo",
    "liveConverterDesc": "Ingrese un n칰mero decimal est치ndar para ver su representaci칩n en tiempo real en diferentes sistemas.",
    "decimalInputLabel": "Ingrese un N칰mero Decimal:",
    "decimalInputPlaceholder": "p.ej., 43",
    "additionTableTitle": "Tabla de Sumar (1 a 24)",
    "multiplicationTableTitle": "Tabla de Multiplicar (1 a 24)",
    "explanationTitle": "Entendiendo el Sistema Biyectivo",
    "explanationDesc1": "Este sistema es una <strong>numeraci칩n biyectiva de base 6</strong>. Es posicional, pero con dos diferencias clave: no tiene cero y sus d칤gitos van del 1 al 6. Como no hay cero para actuar como marcador de posici칩n, el sistema 'da la vuelta' de manera diferente. Despu칠s de <code>6</code>, el siguiente n칰mero es <code>11</code>.",
    "algoTitle": "Explicaci칩n del Algoritmo de Conversi칩n",
    "algoDesc1": "El truco para convertir de decimal a base 6 biyectiva es cambiar temporalmente el sistema num칠rico. Las computadoras trabajan naturalmente con restos de 0 a 5, pero nuestros d칤gitos son de 1 a 6. Salvamos esta brecha restando 1 antes de cada c치lculo.",
    "visualizerTitle": "Visualizador de Algoritmo",
    "visualizerDesc": "Ingrese un n칰mero decimal para ver el algoritmo de conversi칩n en acci칩n.",
    "visualizerInputPlaceholder": "Ingrese decimal para visualizar...",
    "visualizeBtn": "Visualizar",
    "formalLangTitle": "La Magia Detr치s de las Matem치ticas: Un V칤nculo con la Teor칤a de Lenguajes Formales",
    "formalLangDesc1": "El sistema biyectivo de base 6 tiene una profunda y hermosa conexi칩n con la teor칤a de lenguajes formales, una piedra angular de la inform치tica te칩rica.",
    "formalLangDesc2": "En este campo, definimos un alfabeto, Sigma, como un conjunto de s칤mbolos. Para nuestro sistema, el alfabeto es Sigma = {1, 2, 3, 4, 5, 6}.",
    "formalLangDesc3": "El conjunto de todas las cadenas posibles que se pueden crear con este alfabeto se conoce como la estrella de Kleene (o clausura de Kleene) de Sigma, denotada como Sigma*. Este conjunto incluye cadenas de cualquier longitud finita: {cadena vac칤a, 1, 2, ..., 6, 11, 12, ..., 66, 111, ...}.",
    "formalLangDesc4": "El sistema biyectivo de base 6 es esencialmente una enumeraci칩n perfecta y ordenada de la estrella de Kleene del alfabeto {1, 2, 3, 4, 5, 6}, si asignamos la cadena vac칤a al cero. Cada entero positivo corresponde exactamente a una cadena, y cada cadena corresponde exactamente a un entero positivo. Esto es incre칤blemente poderoso porque proporciona una forma fluida de asignar un n칰mero 칰nico a cualquier secuencia de eventos o elecciones de un conjunto de seis, una operaci칩n fundamental en algoritmos y teor칤a de la computabilidad.",
    "geomTitle": "Una Interpretaci칩n Geom칠trica: El 츼rbol 6-ario Infinito",
    "geomDesc1": "Podemos visualizar todo el sistema como un 치rbol 6-ario infinito y completo. Un 치rbol 6-ario es una estructura donde cada nodo tiene exactamente seis hijos.",
    "geomDesc2": "La ra칤z del 치rbol puede considerarse como un punto de partida (que representa el n칰mero 0 o la cadena vac칤a).",
    "geomList": [ "El primer nivel de nodos est치 etiquetado como 1, 2, 3, 4, 5 y 6.", "Cada uno de esos nodos tiene seis hijos. Por ejemplo, el nodo \"1\" es el padre de los nodos \"11\", \"12\", \"13\", \"14\", \"15\" y \"16\"." ],
    "geomDesc4": "En este modelo, cada n칰mero biyectivo de base 6 es la \"direcci칩n\" o \"ruta\" 칰nica desde la ra칤z hasta un nodo espec칤fico. Por ejemplo, el n칰mero 425 significa:",
    "geomPathList": [ "Comenzar en la ra칤z.", "Tomar la 4춹 rama.", "Desde ese nodo, tomar la 2춹 rama.", "Desde ese nodo, tomar la 5춹 rama." ],
    "hashingTitle": "Una Nota sobre Colisiones y Hashing",
    "hashingDesc": "Al observar la tabla de multiplicar se revela que <code>2 칑 3 = 6</code> y <code>1 칑 6 = 6</code>. Esto es una <strong>colisi칩n</strong>. Aunque es interesante matem치ticamente, esta propiedad es lo opuesto a lo que se desea en las funciones de hash criptogr치ficas (como SHA-256), que deben dise침arse espec칤ficamente para que encontrar colisiones sea computacionalmente inviable. Este sistema, por lo tanto, es una buena herramienta para comprender el concepto de colisiones, pero no es un algoritmo de hash seguro en s칤 mismo.",
    "prosTitle": "Ventajas de la Base 6 Biyectiva",
    "prosIntro": "La naturaleza sin cero de este sistema proporciona varios beneficios 칰nicos, especialmente en computaci칩n e identificadores legibles por humanos.",
    "pros": [
        { "title": "Sin Ambig칲edades y Amigable para Humanos", "desc": "La ausencia de ceros a la izquierda significa que no hay confusi칩n. <code>123</code> es siempre <code>123</code>, nunca <code>0123</code>. Esto es ideal para c칩digos de producto, n칰meros de serie o enlaces cortos donde la claridad es cr칤tica." },
        { "title": "Compacto y Eficiente", "desc": "Cada posible cadena de d칤gitos es un n칰mero v치lido, lo que lo convierte en una forma muy densa y eficiente de representar datos. No hay combinaciones desperdiciadas o inv치lidas." },
        { "title": "Ajuste Natural para la Computaci칩n", "desc": "El mapeo uno a uno es ideal para algoritmos que necesitan identificadores 칰nicos, como indexar estructuras de datos complejas o generar claves en sistemas distribuidos." },
        { "title": "Eliminaci칩n de Referencias Nulas (Una Idea Te칩rica)", "desc": "Preguntaste si una computadora construida en este sistema tendr칤a punteros nulos. 춰En un sentido te칩rico, has dado con algo profundo! Como no hay un \"cero\" para representar \"nada\" o un estado no inicializado, cada secuencia posible de d칤gitos se refiere a un n칰mero v치lido y 칰nico. Esto se corresponde maravillosamente con la idea de eliminar las referencias nulas, una fuente com칰n de errores en la programaci칩n." },
        { "title": "Conteo m치s alto con los dedos", "desc": "Con diez dedos, puedes contar mucho m치s all치 de 10. Cada mano puede representar un d칤gito biyectivo de base 6 (1-5 dedos, o un pu침o cerrado para el 6). Con dos manos, puedes representar cada n칰mero del 1 al 42, donde mostrar un dedo en tu mano izquierda y uno en tu derecha es 7 (biyectivo 11)." }
    ],
    "consTitle": "Desventajas y Compensaciones",
    "consIntro": "Aunque es potente, el sistema no se utiliza ampliamente para la aritm칠tica general por algunas razones clave.",
    "cons": [
        { "title": "Aritm칠tica No Familiar", "desc": "Las reglas para llevar y pedir prestado en la suma y la resta son diferentes a las del sistema decimal, lo que hace que el c치lculo mental y manual sea un desaf칤o para la mayor칤a de las personas." },
        { "title": "Sobrecarga de Conversi칩n", "desc": "No es un sistema nativo para las computadoras (que usan binario) ni para los humanos (que usan decimal). Siempre se requiere un paso de conversi칩n al interactuar con otros sistemas, lo que a침ade una sobrecarga computacional." },
        { "title": "Soporte Nativo Limitado", "desc": "Muy pocos lenguajes de programaci칩n o bibliotecas est치ndar tienen funciones integradas para la numeraci칩n biyectiva. Esto significa que los desarrolladores deben implementar una l칩gica personalizada para todas las operaciones aritm칠ticas y de conversi칩n." },
        { "title": "Patrones de Multiplicaci칩n Complejos", "desc": "A diferencia de las bases est치ndar donde multiplicar por la base simplemente a침ade un cero, los patrones en la multiplicaci칩n biyectiva son menos intuitivos, lo que dificulta la realizaci칩n de estimaciones o c치lculos r치pidos." }
    ],
    "practiceTitle": "Modo de Pr치ctica",
    "practiceDesc": "춰Pon a prueba tus habilidades contra el reloj! Elige una dificultad y resuelve los problemas.",
    "difficultyLabel": "Dificultad:",
    "difficultyEasy": "F치cil",
    "difficultyMedium": "Medio",
    "difficultyHard": "Dif칤cil",
    "quizQuestion": "쯈u칠 es",
    "quizTypeConversion": "Conversi칩n",
    "quizTypeMath": "Matem치ticas",
    "quizQuestionConversionSuffix": "en base 6 biyectiva?",
    "quizAnswerPlaceholder": "Tu respuesta...",
    "quizSubmitBtn": "Enviar",
    "quizCorrectFeedback": "춰Correcto! 游꿀",
    "quizIncorrectFeedback": "춰No del todo! La respuesta correcta era",
    "quizNextBtn": "Siguiente Pregunta",
    "timeLabel": "Tiempo:",
    "githubLink": "C칩digo fuente del proyecto disponible en",
    "licenseLink": "Publicado bajo la",
    "ui_loading": "Cargando...",
    "errorBothNumbers": "Por favor, ingrese ambos n칰meros.",
    "errorGeneric": "Error:"
}
