{
    "pageTitle": "Calculadora y Explorador Bijective Base-6",
    "pageDescription": "Una herramienta educativa interactiva para calcular y explorar el sistema num칠rico biyectivo de base 6, que no tiene cero. Incluye un convertidor en tiempo real y tablas de referencia.",
    "mainTitle": "Calculadora y Explorador Bijective Base-6",
    "tabCalculator": "Calculadora",
    "tabTables": "Tablas de Referencia",
    "tabLearn": "Aprender",
    "tabPractice": "Practicar",
    "calculatorTitle": "Calculadora Matem치tica Biyectiva",
    "calculatorDesc": "Ingrese dos n칰meros en base 6 biyectiva para ver los resultados de todas las operaciones matem치ticas est치ndar.",
    "num1Placeholder": "Primer n칰mero",
    "num2Placeholder": "Segundo n칰mero",
    "calculateBtn": "Calcular Todas las Operaciones",
    "resultsTitle": "Resultados",
    "liveConverterTitle": "Explorador de Sistemas Num칠ricos en Vivo",
    "liveConverterDesc": "Ingrese un n칰mero decimal est치ndar para ver su representaci칩n en tiempo real en diferentes sistemas.",
    "decimalInputLabel": "Ingrese un N칰mero Decimal:",
    "decimalInputPlaceholder": "p.ej., 43",
    "additionTableTitle": "Tabla de Sumar (1 a 24)",
    "multiplicationTableTitle": "Tabla de Multiplicar (1 a 24)",
    "explanationTitle": "Entendiendo el Sistema Biyectivo",
    "explanationDesc1": "Este sistema es una <strong>numeraci칩n biyectiva de base 6</strong>. Es posicional, pero con dos diferencias clave: no tiene cero y sus d칤gitos van del 1 al 6. Como no hay cero para actuar como marcador de posici칩n, el sistema 'da la vuelta' de manera diferente. Despu칠s de <code>6</code>, el siguiente n칰mero es <code>11</code>.",
    "algoTitle": "Explicaci칩n del Algoritmo de Conversi칩n",
    "algoDesc1": "El truco para convertir de decimal a base 6 biyectiva es cambiar temporalmente el sistema num칠rico. Las computadoras trabajan naturalmente con restos de 0 a 5, pero nuestros d칤gitos son de 1 a 6. Salvamos esta brecha restando 1 antes de cada c치lculo.",
    "visualizerTitle": "Visualizador de Algoritmo",
    "visualizerDesc": "Ingrese un n칰mero decimal para ver el algoritmo de conversi칩n en acci칩n.",
    "visualizerInputPlaceholder": "Ingrese decimal para visualizar...",
    "visualizeBtn": "Visualizar",
    "formalLangTitle": "La Magia Detr치s de las Matem치ticas: Un V칤nculo con la Teor칤a de Lenguajes Formales",
    "formalLangDesc1": "El sistema biyectivo de base 6 tiene una profunda y hermosa conexi칩n con la teor칤a de lenguajes formales, una piedra angular de la inform치tica te칩rica.",
    "formalLangDesc2": "En este campo, definimos un alfabeto, Sigma, como un conjunto de s칤mbolos. Para nuestro sistema, el alfabeto es Sigma = {1, 2, 3, 4, 5, 6}.",
    "formalLangDesc3": "El conjunto de todas las cadenas posibles que se pueden crear con este alfabeto se conoce como la estrella de Kleene (o clausura de Kleene) de Sigma, denotada como Sigma*. Este conjunto incluye cadenas de cualquier longitud finita: {cadena vac칤a, 1, 2, ..., 6, 11, 12, ..., 66, 111, ...}.",
    "formalLangDesc4": "El sistema biyectivo de base 6 es esencialmente una enumeraci칩n perfecta y ordenada de la estrella de Kleene del alfabeto {1, 2, 3, 4, 5, 6}, si asignamos la cadena vac칤a al cero. Cada entero positivo corresponde exactamente a una cadena, y cada cadena corresponde exactamente a un entero positivo. Esto es incre칤blemente poderoso porque proporciona una forma fluida de asignar un n칰mero 칰nico a cualquier secuencia de eventos o elecciones de un conjunto de seis, una operaci칩n fundamental en algoritmos y teor칤a de la computabilidad.",
    "geomTitle": "Una Interpretaci칩n Geom칠trica: El 츼rbol 6-ario Infinito",
    "geomDesc1": "Podemos visualizar todo el sistema como un 치rbol 6-ario infinito y completo. Un 치rbol 6-ario es una estructura donde cada nodo tiene exactamente seis hijos.",
    "geomDesc2": "La ra칤z del 치rbol puede considerarse como un punto de partida (que representa el n칰mero 0 o la cadena vac칤a).",
    "geomList": [ "El primer nivel de nodos est치 etiquetado como 1, 2, 3, 4, 5 y 6.", "Cada uno de esos nodos tiene seis hijos. Por ejemplo, el nodo \"1\" es el padre de los nodos \"11\", \"12\", \"13\", \"14\", \"15\" y \"16\"." ],
    "geomDesc4": "En este modelo, cada n칰mero biyectivo de base 6 es la \"direcci칩n\" o \"ruta\" 칰nica desde la ra칤z hasta un nodo espec칤fico. Por ejemplo, el n칰mero 425 significa:",
    "geomPathList": [ "Comenzar en la ra칤z.", "Tomar la 4춹 rama.", "Desde ese nodo, tomar la 2춹 rama.", "Desde ese nodo, tomar la 5춹 rama." ],
    "hashingTitle": "Una Nota sobre Colisiones y Hashing",
    "hashingDesc": "Al observar la tabla de multiplicar se revela que <code>2 칑 3 = 6</code> y <code>1 칑 6 = 6</code>. Esto es una <strong>colisi칩n</strong>, donde diferentes entradas producen la misma salida. Aunque es interesante matem치ticamente, esta propiedad es lo opuesto a lo que se desea en las funciones de hash criptogr치ficas (como SHA-256), que deben dise침arse espec칤ficamente para que encontrar colisiones sea computacionalmente inviable. Este sistema, por lo tanto, es una buena herramienta para comprender el concepto de colisiones, pero no es un algoritmo de hash seguro en s칤 mismo.",
    "readingTitle": "Lecturas Adicionales y Exploraci칩n",
    "readingList": [
        "<strong>Estructura e Interpretaci칩n de Programas de Computadora (SICP)</strong> por Abelson, Sussman y Sussman: Un texto fundamental que ense침a conceptos b치sicos de programaci칩n y computaci칩n.",
        "<strong>G칬del, Escher, Bach: una Eterna Trenza Dorada</strong> por Douglas Hofstadter: Un libro ganador del Pulitzer que explora conceptos de matem치ticas, simetr칤a e inteligencia a trav칠s de las obras de un l칩gico, un artista y un compositor.",
        "<strong>Introducci칩n a los Algoritmos (CLRS)</strong> por Cormen, Leiserson, Rivest y Stein: El libro de texto universitario esencial para el dise침o y an치lisis de algoritmos inform치ticos.",
        "<strong>Matem치ticas Concretas: Una Fundaci칩n para la Inform치tica</strong> por Graham, Knuth y Patashnik: Una mezcla brillante y desafiante de matem치ticas continuas y discretas, que proporciona una base m치s profunda para las matem치ticas detr치s de la inform치tica."
    ],
    "practiceTitle": "Modo de Pr치ctica",
    "practiceDesc": "춰Pon a prueba tus habilidades contra el reloj! Elige una dificultad y resuelve los problemas.",
    "difficultyLabel": "Dificultad:",
    "difficultyEasy": "F치cil (1-12)",
    "difficultyHard": "Dif칤cil (1-50)",
    "quizQuestion": "쯈u칠 es",
    "quizSubmitBtn": "Enviar",
    "quizCorrectFeedback": "춰Correcto! 游꿀",
    "quizIncorrectFeedback": "춰No del todo! La respuesta correcta era",
    "quizNextBtn": "Siguiente Pregunta",
    "timeLabel": "Tiempo:",
    "donationBtn": "Apoya este Proyecto",
    "githubLink": "C칩digo fuente del proyecto disponible en",
    "licenseLink": "Publicado bajo la",
    "ui_loading": "Cargando...",
    "errorBothNumbers": "Por favor, ingrese ambos n칰meros.",
    "errorGeneric": "Error:"
}
