{
    "pageTitle": "Calculatrice et Explorateur Bijective Base-6",
    "pageDescription": "Un outil éducatif interactif pour calculer et explorer le système numérique bijectif en base 6, qui n'a pas de zéro. Comprend un convertisseur en temps réel et des tables de référence.",
    "mainTitle": "Calculatrice et Explorateur Bijective Base-6",
    "tabCalculator": "Calculatrice",
    "tabTables": "Tables de Référence",
    "tabProsCons": "Avantages & Inconvénients",
    "tabLearn": "Apprendre",
    "tabPractice": "Pratiquer",
    "calculatorTitle": "Calculatrice Mathématique Bijective",
    "calculatorDesc": "Entrez deux nombres en base 6 bijective pour voir les résultats de toutes les opérations mathématiques standard.",
    "num1Placeholder": "Premier nombre",
    "num2Placeholder": "Deuxième nombre",
    "calculateBtn": "Calculer Toutes les Opérations",
    "resultsTitle": "Résultats",
    "liveConverterTitle": "Explorateur de Systèmes Numériques en Direct",
    "liveConverterDesc": "Entrez un nombre décimal standard pour voir sa représentation en temps réel dans différents systèmes.",
    "decimalInputLabel": "Entrez un Nombre Décimal :",
    "decimalInputPlaceholder": "ex: 43",
    "additionTableTitle": "Table d'Addition (1 à 24)",
    "multiplicationTableTitle": "Table de Multiplication (1 à 24)",
    "explanationTitle": "Comprendre le Système Bijectif",
    "explanationDesc1": "Ce système est une <strong>numération bijective en base 6</strong>. Il est positionnel, mais avec deux différences clés : il n'a pas de zéro et ses chiffres vont de 1 à 6. Comme il n'y a pas de zéro pour servir d'espace réservé, le système 'passe au suivant' différemment. Après <code>6</code>, le nombre suivant est <code>11</code>.",
    "algoTitle": "Explication de l'Algorithme de Conversion",
    "algoDesc1": "L'astuce pour convertir du décimal à la base 6 bijective est de décaler temporairement le système numérique. Les ordinateurs travaillent naturellement avec des restes de 0 à 5, mais nos chiffres sont de 1 à 6. Nous comblons cet écart en soustrayant 1 avant chaque calcul.",
    "visualizerTitle": "Visualiseur d'Algorithme",
    "visualizerDesc": "Entrez un nombre décimal pour voir l'algorithme de conversion en action.",
    "visualizerInputPlaceholder": "Entrez un décimal pour visualiser...",
    "visualizeBtn": "Visualiser",
    "formalLangTitle": "Les Mathématiques Derrière la Magie : Un Lien avec la Théorie des Langages Formels",
    "formalLangDesc1": "Le système bijectif en base 6 a une connexion profonde et magnifique avec la théorie des langages formels, une pierre angulaire de l'informatique théorique.",
    "formalLangDesc2": "Dans ce domaine, nous définissons un alphabet, Sigma, comme un ensemble de symboles. Pour notre système, l'alphabet est Sigma = {1, 2, 3, 4, 5, 6}.",
    "formalLangDesc3": "L'ensemble de toutes les chaînes possibles pouvant être créées à l'aide de cet alphabet est connu sous le nom d'étoile de Kleene (ou clôture de Kleene) de Sigma, notée Sigma*. Cet ensemble comprend des chaînes de n'importe quelle longueur finie : {chaîne vide, 1, 2, ..., 6, 11, 12, ..., 66, 111, ...}.",
    "formalLangDesc4": "Le système bijectif en base 6 est essentiellement une énumération parfaite et ordonnée de l'étoile de Kleene de l'alphabet {1, 2, 3, 4, 5, 6}, si nous associons la chaîne vide à zéro. Chaque entier positif correspond à exactement une chaîne, et chaque chaîne correspond à exactement un entier positif. C'est incroyablement puissant car cela fournit un moyen transparent d'attribuer un numéro unique à n'importe quelle séquence d'événements ou de choix parmi un ensemble de six, une opération fondamentale en algorithmique et en théorie de la calculabilité.",
    "geomTitle": "Une Interprétation Géométrique : L'Arbre 6-aire Infini",
    "geomDesc1": "Nous pouvons visualiser l'ensemble du système comme un arbre 6-aire complet et infini. Un arbre 6-aire est une structure où chaque nœud a exactement six enfants.",
    "geomDesc2": "La racine de l'arbre peut être considérée comme un point de départ (représentant le nombre 0 ou la chaîne vide).",
    "geomList": [ "Le premier niveau de nœuds est étiqueté 1, 2, 3, 4, 5 et 6.", "Chacun de ces nœuds a six enfants. Par exemple, le nœud \"1\" est le parent des nœuds \"11\", \"12\", \"13\", \"14\", \"15\" et \"16\"." ],
    "geomDesc4": "Dans ce modèle, chaque nombre bijectif en base 6 est l'\"adresse\" ou le \"chemin\" unique de la racine à un nœud spécifique. Par exemple, le nombre 425 signifie :",
    "geomPathList": [ "Commencer à la racine.", "Prendre la 4ème branche.", "À partir de ce nœud, prendre la 2ème branche.", "À partir de ce nœud, prendre la 5ème branche." ],
    "hashingTitle": "Note sur les Collisions et le Hachage",
    "hashingDesc": "L'observation de la table de multiplication révèle que <code>2 × 3 = 6</code> et <code>1 × 6 = 6</code>. C'est une <strong>collision</strong>. Bien qu'intéressant sur le plan mathématique, cette propriété est à l'opposé de ce qui est souhaité dans les fonctions de hachage cryptographiques (comme SHA-256), qui doivent être spécifiquement conçues pour rendre la recherche de collisions informatiquement irréalisable. Ce système est donc un bon outil pour comprendre le concept de collisions, mais n'est pas un algorithme de hachage sécurisé en soi.",
    "prosTitle": "Avantages de la Base 6 Bijective",
    "prosIntro": "La nature sans zéro de ce système offre plusieurs avantages uniques, notamment en informatique et pour les identifiants lisibles par l'homme.",
    "pros": [
        { "title": "Sans Ambigüité et Convivial", "desc": "L'absence de zéros non significatifs élimine toute confusion. <code>123</code> est toujours <code>123</code>, jamais <code>0123</code>. C'est idéal pour les codes de produits, les numéros de série ou les liens courts où la clarté est essentielle." },
        { "title": "Compact et Efficace", "desc": "Chaque chaîne de chiffres possible est un nombre valide, ce qui en fait un moyen très dense et efficace de représenter les données. Il n'y a pas de combinaisons gaspillées ou invalides." },
        { "title": "Adaptation Naturelle à l'Informatique", "desc": "La correspondance biunivoque est idéale pour les algorithmes nécessitant des identifiants uniques, comme l'indexation de structures de données complexes ou la génération de clés dans des systèmes distribués." },
        { "title": "Élimination des Références Nulles (Une Idée Théorique)", "desc": "Vous avez demandé si un ordinateur construit sur ce système aurait des pointeurs nuls. D'un point de vue théorique, vous touchez à quelque chose de profond ! Comme il n'y a pas de \"zéro\" pour représenter \"rien\" ou un état non initialisé, chaque séquence possible de chiffres fait référence à un nombre valide et unique. Cela correspond parfaitement à l'idée d'éliminer les références nulles, une source courante de bogues en programmation." },
        { "title": "Comptage plus élevé sur les doigts", "desc": "Avec dix doigts, vous pouvez compter bien au-delà de 10. Chaque main peut représenter un chiffre bijectif en base 6 (1-5 doigts, ou un poing fermé pour 6). Avec deux mains, vous pouvez représenter chaque nombre de 1 à 42, où montrer un doigt sur votre main gauche et un sur votre droite correspond à 7 (bijectif 11)." }
    ],
    "consTitle": "Inconvénients et Compromis",
    "consIntro": "Bien que puissant, le système n'est pas largement utilisé pour l'arithmétique générale pour quelques raisons clés.",
    "cons": [
        { "title": "Arithmétique Peu Familière", "desc": "Les règles de retenue pour l'addition et la soustraction sont différentes de celles du système décimal, ce qui rend le calcul mental et manuel difficile pour la plupart des gens." },
        { "title": "Surcharge de Conversion", "desc": "Ce n'est pas un système natif pour les ordinateurs (qui utilisent le binaire) ou les humains (qui utilisent le décimal). une étape de conversion est toujours nécessaire lors de l'interaction avec d'autres systèmes, ce qui ajoute une surcharge de calcul." },
        { "title": "Support Natif Limité", "desc": "Très peu de langages de programmation ou de bibliothèques standard ont des fonctions intégrées pour la numération bijective. Cela signifie que les développeurs doivent implémenter une logique personnalisée pour toutes les opérations arithmétiques et de conversion." },
        { "title": "Modèles de Multiplication Complexes", "desc": "Contrairement aux bases standard où la multiplication par la base ajoute simplement un zéro, les modèles de la multiplication bijective sont moins intuitifs, ce qui rend plus difficile la réalisation d'estimations ou de calculs rapides." }
    ],
    "practiceTitle": "Mode Pratique",
    "practiceDesc": "Testez vos compétences contre la montre ! Choisissez une difficulté et résolvez les problèmes.",
    "difficultyLabel": "Difficulté :",
    "difficultyEasy": "Facile",
    "difficultyMedium": "Moyen",
    "difficultyHard": "Difficile",
    "quizQuestion": "Qu'est-ce que",
    "quizTypeConversion": "Conversion",
    "quizTypeMath": "Maths",
    "quizQuestionConversionSuffix": "en base 6 bijective ?",
    "quizAnswerPlaceholder": "Votre réponse...",
    "quizSubmitBtn": "Soumettre",
    "quizCorrectFeedback": "Correct ! 🎉",
    "quizIncorrectFeedback": "Pas tout à fait ! La bonne réponse était",
    "quizNextBtn": "Question Suivante",
    "timeLabel": "Temps :",
    "githubLink": "Code source du projet disponible sur",
    "licenseLink": "Publié sous la",
    "ui_loading": "Chargement...",
    "errorBothNumbers": "Veuillez entrer les deux numéros.",
    "errorGeneric": "Erreur:"
}
