{
    "pageTitle": "Calculatrice et Explorateur Bijective Base-6",
    "pageDescription": "Un outil éducatif interactif pour calculer et explorer le système numérique bijectif en base 6, qui n'a pas de zéro. Comprend un convertisseur en temps réel et des tables de référence.",
    "themeSwitcherLabel": "Changer de thème",
    "mainTitle": "Calculatrice et Explorateur Bijective Base-6",
    "tabCalculator": "Calculatrice & Explorateur",
    "tabTables": "Tables de Référence",
    "tabExplanations": "Explications",
    "liveConverterTitle": "Explorateur de Conversion en Direct",
    "liveConverterDesc": "Entrez un nombre décimal pour voir sa représentation dans différents systèmes en temps réel.",
    "decimalInputLabel": "Entrez un nombre décimal :",
    "decimalInputPlaceholder": "ex: 25",
    "calculatorTitle": "Calculatrice Mathématique Bijective",
    "calculatorDesc": "Entrez deux nombres en base 6 bijective pour voir les résultats de toutes les opérations mathématiques standard.",
    "num1Placeholder": "Premier nombre",
    "num2Placeholder": "Deuxième nombre",
    "calculateBtn": "Calculer Toutes les Opérations",
    "resultsTitle": "Résultats",
    "additionTableTitle": "Table d'Addition (1 à 12)",
    "multiplicationTableTitle": "Table de Multiplication (1 à 12)",
    "primerTitle": "Introduction aux Systèmes Numériques",
    "primerDesc1": "La plupart des systèmes numériques que nous utilisons sont <strong>positionnels</strong>. Cela signifie que la valeur d'un chiffre dépend de sa position dans un nombre. La \"base\" d'un système nous indique combien de chiffres uniques sont utilisés.",
    "primerDesc2": "Dans ces systèmes standard, le chiffre <strong>zéro</strong> est essentiel en tant que <strong>espace réservé</strong>. Il signifie une position vide, comme la place des dizaines dans <code>101</code>. Le système bijectif que vous explorez est fascinant car il fonctionne sans cela.",
    "explanationTitle": "Comprendre le Système Bijectif",
    "explanationDesc1": "Ce système est une <strong>numération bijective en base 6</strong>. Il est positionnel, mais n'a pas de zéro ; les chiffres sont <strong>1, 2, 3, 4, 5, 6</strong>. Comme il n'y a pas de zéro, le système \"passe au suivant\" différemment. Après <code>6</code>, le nombre suivant est <code>11</code>.",
    "algoTitle": "Explication de l'Algorithme de Conversion",
    "algoDesc1": "L'astuce pour convertir du décimal à la base 6 bijective est de décaler temporairement le système numérique. Les ordinateurs travaillent naturellement avec des restes de 0 à 5, mais nos chiffres sont de 1 à 6. Nous comblons cet écart en soustrayant 1 avant chaque calcul.",
    "algoExampleTitle": "Convertissons le nombre décimal <strong>43</strong> :",
    "algoSteps": [
        "<strong>Étape 1 :</strong> <code>(43 - 1) % 6 = 0</code>. Le 0ème chiffre dans <code>\"123456\"</code> est '1'. Résultat : <strong>1</strong>. Nombre suivant : <code>(43 - 1) / 6 = 7</code>.",
        "<strong>Étape 2 :</strong> <code>(7 - 1) % 6 = 0</code>. Le 0ème chiffre est \'1\'. Résultat : <strong>1</strong>. Nombre suivant : <code>(7 - 1) / 6 = 1</code>.",
        "<strong>Étape 3 :</strong> <code>(1 - 1) % 6 = 0</code>. Le 0ème chiffre est \'1\'. Résultat : <strong>1</strong>. Nombre suivant : <code>(1 - 1) / 6 = 0</code>."
    ],
    "algoResult": "En inversant les chiffres, on obtient <code>111</code>. Ainsi, 43 en décimal est 111 en base 6 bijective.",
    "applicationsTitle": "Applications Pratiques",
    "appDesc1": "La numération bijective est plus qu'une curiosité mathématique ; elle résout des problèmes concrets en informatique.",
    "appList": [
        "<strong>Colonnes de tableur :</strong> Microsoft Excel et Google Sheets utilisent un système bijectif en base 26 (A-Z). Après Z vient AA, puis AB. C'est un exemple parfait du monde réel où il n'y a pas de colonne \"zéro\".",
        "<strong>Raccourcisseurs d'URL :</strong> Des services comme bit.ly utilisent un système bijectif en base 62 (<code>a-z, A-Z, 0-9</code>) pour mapper des ID de bases de données massives à des chaînes courtes, uniques et lisibles.",
        "<strong>Compter sur ses doigts :</strong> Avec dix doigts, vous pouvez compter jusqu'à 10 en décimal. Mais dans un système bijectif, vous pouvez aller beaucoup plus haut ! Si chaque doigt peut être levé (1) ou baissé (2), vous avez un système bijectif en base 2. Avec 10 doigts, vous pouvez représenter 2¹⁰ = 1024 nombres. Cela montre la puissance de la représentation dense et sans zéro."
    ],
    "advancedTitle": "Connexions Mathématiques Approfondies",
    "advFactorizationTitle": "Note sur les chiffres \"composés\" et la factorisation",
    "advFactorizationDesc": "Un observateur astucieux de la table de multiplication remarquera que <code>2 × 3 = 6</code>, mais aussi <code>1 × 6 = 6</code>. Dans notre système standard, 6 a une factorisation en nombres premiers unique (2 et 3). Cependant, dans le système bijectif, <strong>le chiffre <code>6</code> lui-même agit comme un nombre composé</strong>. Les chiffres <code>1, 2, 3, 4, 5</code> sont les \"nombres premiers\" de ce monde à un seul chiffre. Cela révèle que l'ensemble des chiffres uniques ne forme pas un <a href=\"https://en.wikipedia.org/wiki/Unique_factorization_domain\" target=\"_blank\">anneau factoriel</a>, une conséquence directe de l'utilisation de la base `k` comme chiffre au lieu de `0`.",
    "advFormalLangTitle": "Lien avec la Théorie des Langages Formels",
    "advFormalLangDesc": "Le système bijectif en base 6 a un lien magnifique avec l'informatique théorique. Si nous définissons un alphabet, Σ, comme notre ensemble de chiffres <code>{1, 2, 3, 4, 5, 6}</code>, alors l'ensemble de toutes les chaînes finies possibles (l'étoile de Kleene, Σ*) peut être parfaitement énuméré par les entiers positifs. Cela offre un moyen transparent d'attribuer un numéro unique à toute séquence de choix parmi un ensemble de six.",
    "advGeoTitle": "Interprétation Géométrique : L'Arbre Infini",
    "advGeoDesc": "Nous pouvons visualiser le système comme un arbre 6-aire infini et complet, où chaque nœud a six enfants. Chaque nombre bijectif en base 6 est l'\"adresse\" ou le chemin unique de la racine à un nœud spécifique. Le nombre <code>425</code> signifie : commencer à la racine, prendre la 4ème branche, puis la 2ème, puis la 5ème. Ceci est crucial pour l'indexation de données hiérarchiques où chaque partie de l'adresse est un choix significatif.",
    "donationBtn": "Soutenir ce Projet",
    "githubLink": "Code source du projet disponible sur",
    "licenseLink": "Publié sous la"
}
