{
    "pageTitle": "Calculatrice et Explorateur Bijectif Base-6",
    "pageDescription": "Un outil éducatif interactif pour calculer et explorer le système numérique bijectif en base 6 (un système numérique sans zéro). Comprend un convertisseur en direct, des tables de référence et des explications détaillées.",
    "mainTitle": "Calculatrice et Explorateur Bijectif Base-6",
    "tabCalculator": "🧮 Calculatrice & Explorateur",
    "tabTables": "📚 Tables de Référence",
    "tabExplanations": "🎓 Explications",
    "liveConverterTitle": "Explorateur de Conversion en Direct",
    "liveConverterDesc": "Entrez un nombre décimal pour voir sa représentation en temps réel dans différents systèmes.",
    "decimalInputLabel": "Entrez un Nombre Décimal :",
    "calculatorTitle": "Calculatrice Mathématique Bijective",
    "calculatorDesc": "Entrez deux nombres bijectifs en base 6 pour voir les résultats de toutes les opérations mathématiques standard.",
    "num1Placeholder": "Premier nombre",
    "num2Placeholder": "Deuxième nombre",
    "calculateBtn": "Calculer Toutes les Opérations",
    "resultsTitle": "Résultats",
    "additionTableTitle": "Table d'Addition (1 à 12)",
    "multiplicationTableTitle": "Table de Multiplication (1 à 12)",
    "primerTitle": "Introduction aux Systèmes Numériques",
    "primerDesc1": "La plupart des systèmes numériques que nous utilisons sont <strong>positionnels</strong>. Cela signifie que la valeur d'un chiffre dépend de sa position dans un nombre. La \"base\" d'un système nous indique combien de chiffres uniques sont utilisés. La valeur de chaque position est une puissance de la base, en commençant par 0 à droite.",
    "primerDesc2": "Dans ces systèmes standard, le chiffre <strong>zéro</strong> est essentiel. Ce n'est pas seulement un nombre, mais un <strong>espace réservé</strong> fondamental. Il signifie une position vide, comme la place des dizaines dans <code>101</code>. Le système bijectif que vous explorez est fascinant car il fonctionne sans cet espace réservé.",
    "explanationTitle": "Comprendre le Système Bijectif",
    "explanationDesc1": "Ce système est une <strong>numération bijective en base 6</strong>. Il est positionnel, mais avec deux différences clés : il n'a pas de zéro, et ses chiffres vont de 1 à 6. Comme il n'y a pas de zéro pour servir d'espace réservé, le système \"reporte\" différemment. Après <code>6</code>, le nombre suivant est <code>11</code>.",
    "algoTitle": "L'Algorithme de Conversion Expliqué",
    "algoDesc": "L'astuce pour convertir du décimal au bijectif en base 6 est de décaler temporairement le système numérique. Les ordinateurs travaillent naturellement avec des restes de 0 à 5, mais nos chiffres sont de 1 à 6. Nous comblons cet écart en soustrayant 1 avant chaque calcul.",
    "applicationsTitle": "Applications Pratiques",
    "applicationsDesc": "La numération bijective est plus qu'une curiosité ; elle résout des problèmes concrets en informatique.",
    "advancedTitle": "Connexions Mathématiques Approfondies",
    "advancedDesc": "Les propriétés de la numération bijective s'étendent à des domaines plus complexes de l'informatique et des mathématiques, comme la cryptographie et l'énumération algorithmique.",
    "donationBtn": "Soutenir ce Projet",
    "githubLink": "Source du projet disponible sur",
    "licenseLink": "Publié sous la",
    "errorInput": "Veuillez entrer les deux nombres.",
    "errorInvalid": "L'entrée contient un caractère non valide '{char}'. Seuls les chiffres de 1 à 6 sont autorisés.",
    "errorEmpty": "L'entrée ne peut pas être vide."
}
