{
    "pageTitle": "Calculatrice et Explorateur Bijective Base-6",
    "pageDescription": "Un outil éducatif interactif pour calculer et explorer le système numérique bijectif en base 6, qui n'a pas de zéro.",
    "themeSwitcherLabel": "Changer de thème",
    "mainTitle": "Calculatrice et Explorateur Bijective Base-6",
    "tabCalculator": "Calculatrice & Explorateur",
    "tabTables": "Tables de Référence",
    "tabExplanations": "Explications",
    "calculatorTitle": "Calculatrice Mathématique Bijective",
    "calculatorDesc": "Entrez deux nombres en base 6 bijective pour voir les résultats de toutes les opérations.",
    "num1Placeholder": "Premier nombre",
    "num2Placeholder": "Deuxième nombre",
    "calculateBtn": "Calculer Toutes les Opérations",
    "resultsTitle": "Résultats",
    "additionTableTitle": "Table d'Addition (1-12)",
    "multiplicationTableTitle": "Table de Multiplication (1-12)",
    "primerTitle": "Pourquoi utiliser un système numérique sans zéro ?",
    "primerDesc1": "Dans notre système décimal standard, le zéro est un espace réservé. Mais cela peut causer des problèmes : <code>007</code> est-il identique à <code>7</code> ? Dans la numération bijective, ces problèmes disparaissent. Chaque nombre a une représentation unique, ce qui le rend parfait pour les identifiants et les codes.",
    "primerDesc2": "Un effet secondaire amusant : avec un système bijectif en base 6, vous pouvez compter plus de 10 sur deux mains. Chaque main représente un chiffre (1-6). Le nombre 11 (bijectif) est 7 (décimal), représenté par un doigt sur une main et un sur l'autre. Vous pouvez compter jusqu'à <strong>42</strong> (66 en bijectif) de cette façon !",
    "explanationTitle": "Qu'est-ce que la Base 6 Bijective ?",
    "explanationDesc1": "C'est un système positionnel utilisant les chiffres <strong>1, 2, 3, 4, 5, 6</strong>. Après <code>6</code>, la séquence continue avec <code>11</code>, <code>12</code>, etc., tout comme les colonnes d'un tableur (A-Z, puis AA). Cette correspondance biunivoque (une \"bijection\") entre les nombres et leurs représentations en chaîne est sa caractéristique clé.",
    "algoTitle": "Explication de l'Algorithme de Conversion",
    "algoDesc1": "L'astuce pour convertir du décimal est de décaler temporairement le système numérique. Les ordinateurs utilisent des restes de 0 à 5, mais nos chiffres sont de 1 à 6. Nous comblons cet écart en soustrayant 1 avant chaque calcul.",
    "algoExampleTitle": "Convertissons le nombre décimal <strong>43</strong> :",
    "algoStep1": "<strong>Étape 1 :</strong> <code>(43 - 1) % 6 = 0</code>. Le 0ème chiffre dans <code>&quot;123456&quot;</code> est '1'. Résultat : <strong>1</strong>. Nombre suivant : <code>floor((43 - 1) / 6) = 7</code>.",
    "algoStep2": "<strong>Étape 2 :</strong> <code>(7 - 1) % 6 = 0</code>. Le 0ème chiffre est '1'. Résultat : <strong>11</strong>. Nombre suivant : <code>floor((7 - 1) / 6) = 1</code>.",
    "algoStep3": "<strong>Étape 3 :</strong> <code>(1 - 1) % 6 = 0</code>. Le 0ème chiffre est '1'. Résultat : <strong>111</strong>. Nombre suivant : <code>floor((1 - 1) / 6) = 0</code>.",
    "algoResult": "Le processus s'arrête. Le résultat final est <code>111</code>.",
    "applicationsTitle": "Avantages et Applications Clés",
    "appUnambiguous": "<strong>Sans ambiguïté et convivial :</strong> Parfait pour les codes de produits, les numéros de série ou les raccourcisseurs d'URL qui ne peuvent jamais être mal saisis à cause d'un zéro manquant ou supplémentaire.",
    "appCompact": "<strong>Compact mais lisible :</strong> Plus compact que le binaire mais souvent plus facile à analyser d'un coup d'œil pour les humains que l'hexadécimal.",
    "appCrypto": "<strong>Adaptation naturelle pour la cryptographie :</strong> Garantit des correspondances biunivoques (représentation canonique), ce qui est essentiel pour prévenir les bogues subtils et les vulnérabilités de sécurité. Dans un ordinateur théorique basé sur ce système, la classique 'exception de pointeur nul' (une erreur d'accès à l'adresse 0) n'existerait pas de la même manière, car la première adresse est 1.",
    "darkSecretTitle": "Le Secret le Plus Sombre d'un Monde Sans Zéro",
    "darkSecretDesc": "L'absence de zéro n'est pas seulement une curiosité ; elle a de profondes implications philosophiques. Dans nos mathématiques, le zéro représente à la fois une quantité (rien) et un concept (l'origine). Un système bijectif n'a pas de symbole pour le néant. Le nombre zéro est représenté par la chaîne vide — l'absence de symboles. Cela implique un univers où le concept de 'rien' n'est pas un état à représenter, mais un véritable vide. En informatique, cela signifie qu'il n'y a pas d'adresse 'nulle', ce qui élimine potentiellement toute une classe d'erreurs de programmation courantes à un niveau fondamental.",
    "donationBtn": "Soutenir ce Projet",
    "githubLink": "Code source disponible sur",
    "licenseLink": "Publié sous la licence"
}
