{
    "pageTitle": "מחשבון ומגלה מערכות ספירה ביאקטיבית בבסיס 6",
    "pageDescription": "כלי חינוכי אינטראקטיבי לחישוב ולחקירת מערכת הספירה הביאקטיבית בבסיס 6, שאין בה אפס. כולל ממיר בזמן אמת וטבלאות עזר.",
    "themeSwitcherLabel": "החלף ערכת נושא",
    "mainTitle": "מחשבון ומגלה מערכות ספירה ביאקטיבית בבסיס 6",
    "tabCalculator": "מחשבון ומגלה",
    "tabTables": "טבלאות עזר",
    "tabExplanations": "הסברים",
    "liveConverterTitle": "מגלה המרות בזמן אמת",
    "liveConverterDesc": "הזן מספר עשרוני כדי לראות את ייצוגו במערכות שונות בזמן אמת.",
    "decimalInputLabel": "הזן מספר עשרוני:",
    "decimalInputPlaceholder": "לדוגמה, 25",
    "calculatorTitle": "מחשבון מתמטי ביאקטיבי",
    "calculatorDesc": "הזן שני מספרים במערכת הספירה הביאקטיבית בבסיס 6 כדי לראות את התוצאות של כל הפעולות המתמטיות הסטנדרטיות.",
    "num1Placeholder": "מספר ראשון",
    "num2Placeholder": "מספר שני",
    "calculateBtn": "חשב את כל הפעולות",
    "resultsTitle": "תוצאות",
    "additionTableTitle": "טבלת חיבור (1 עד 12)",
    "multiplicationTableTitle": "טבלת כפל (1 עד 12)",
    "primerTitle": "מבוא למערכות ספירה",
    "primerDesc1": "רוב מערכות הספירה שבהן אנו משתמשים הן <strong>מערכות מיקום</strong>. משמעות הדבר היא שערכה של ספרה תלוי במיקומה בתוך המספר. \"בסיס\" המערכת אומר לנו בכמה ספרות ייחודיות משתמשים. ערכו של כל מיקום הוא חזקה של הבסיס, החל מ-0 מימין.",
    "primerDesc2": "במערכות סטנדרטיות אלה, הספרה <strong>אפס</strong> חיונית. זה לא רק מספר, אלא <strong>מציין מקום</strong> בסיסי. הוא מסמן מיקום ריק, כמו מקום העשרות במספר <code>101</code>. המערכת הביאקטיבית שאתה חוקר מרתקת מכיוון שהיא פועלת ללא מציין מקום זה.",
    "explanationTitle": "הבנת המערכת הביאקטיבית",
    "explanationDesc1": "מערכת זו היא <strong>מערכת ספירה ביאקטיבית בבסיס 6</strong>. היא מערכת מיקום, אך עם שני הבדלים עיקריים: אין לה אפס, והספרות שלה נעות בין 1 ל-6. מכיוון שאין אפס שישמש כמציין מקום, המערכת \"מתגלגלת\" بشكل مختلف. אחרי <code>6</code>, המספר הבא הוא <code>11</code>.",
    "algoTitle": "הסבר על אלגוריתם ההמרה",
    "algoDesc1": "הטריק להמרה ממערכת עשרונית לביאקטיבית בבסיס 6 הוא להזיז זמנית את מערכת המספרים. מחשבים עובדים באופן טבעי עם שאריות מ-0 עד 5, אך הספרות שלנו הן מ-1 עד 6. אנו מגשרים על פער זה על ידי חיסור 1 לפני כל חישוב.",
    "algoExampleTitle": "בואו נמיר את המספר העשרוני <strong>43</strong>:",
    "algoStep1": "<strong>שלב 1:</strong> התחל עם 43. החסר 1: <code>43 - 1 = 42</code>. כעת, מצא את השארית בחלוקה ב-6. <code>42 % 6 = 0</code>. הספרה במקום ה-0 במערך התווים שלנו <code>\\\"123456\\\"</code> היא \'1\'. ספרת התוצאה הראשונה שלנו היא <strong>1</strong>. המספר החדש לשלב הבא הוא <code>(42 - 0) / 6 = 7</code>.",
    "algoStep2": "<strong>שלב 2:</strong> התחל עם 7. החסר 1: <code>7 - 1 = 6</code>. כעת, מצא את השארית. <code>6 % 6 = 0</code>. הספרה במקום ה-0 היא שוב \'1\'. ספרת התוצאה השנייה שלנו היא <strong>1</strong>. המספר החדש הוא <code>(6 - 0) / 6 = 1</code>.",
    "algoStep3": "<strong>שלב 3:</strong> התחל עם 1. החסר 1: <code>1 - 1 = 0</code>. כעת, מצא את השארית. <code>0 % 6 = 0</code>. הספרה במקום ה-0 היא שוב \'1\'. ספרת התוצאה השלישית שלנו היא <strong>1</strong>. המספר החדש הוא <code>(0 - 0) / 6 = 0</code>.",
    "algoResult": "היפוך הספרות נותן <code>111</code>. לפיכך, 43 במערכת עשרונית הוא 111 במערכת ספירה ביאקטיבית בבסיס 6.",
    "applicationsTitle": "יישומים מעשיים",
    "appDesc1": "ספירה ביאקטיבית היא יותר מסתם קוריוז מתמטי; היא פותרת בעיות בעולם האמיתי במדעי המחשב.",
    "appSpreadsheet": "<strong>עמודות בגיליונות אלקטרוניים:</strong> Microsoft Excel ו-Google Sheets משתמשות במערכת ביאקטיבית בבסיס 26 (A-Z) עבור עמודות. אחרי Z מגיע AA, ואז AB, AC וכן הלאה. זוהי דוגמה מושלמת ואינטואיטיבית מהעולם האמיתי שבה אין עמודה \"אפסית\".",
    "appUrl": "<strong>מכווצי כתובות אתרים:</strong> שירותים כמו bit.ly צריכים ליצור את המחרוזת הייחודית הקצרה ביותר האפשרית עבור מיליארדי קישורים. מערכת ביאקטיבית בבסיס 62 (<code>a-z, A-Z, 0-9</code>) יכולה לייצג מזהה מסד נתונים עצום כמו <code>2,183,401,055,849</code> כמחרוזת קצרה ונקייה <code>`short`</code>.",
    "appFingers": "<strong>ספירה על האצבעות:</strong> עם עשר אצבעות, בדרך כלל ניתן לספור עד 10. אך באמצעות מערכת דמוית-ביאקטיבית, ניתן להשיג הרבה יותר. תנו ליד אחת לייצג את מקום ה\"עשרות\" (1-5) והשנייה את מקום ה\"אחדות\" (1-5). כעת תוכלו לייצג בקלות מספרים עד 30 (55 במערכת זו). זה מדגים את צפיפות הנתונים הגבוהה יותר של מערכות אלו.",
    "advancedTitle": "קשרים מתמטיים עמוקים יותר",
    "advFactorizationTitle": "הערה על ספרות \"מורכבות\" ופירוק לגורמים",
    "advFactorizationDesc": "צופה חד עין בטבלת הכפל יבחין בדבר מוזר: <code>2 × 3 = 6</code>, אך גם <code>1 × 6 = 6</code>. במערכת המספרים הסטנדרטית שלנו, למספר 6 יש פירוק ראשוני ייחודי (2 ו-3). עם זאת, במערכת הביאקטיבית, <strong>הספרה <code>6</code> עצמה מתנהגת כמספר מורכב</strong>. הספרות <code>1, 2, 3, 4, 5</code> הן המספרים ה\"ראשוניים\" בעולם זה של ספרה אחת. זה חושף תכונה עמוקה: קבוצת הספרות הבודדות במערכת ביאקטיבית אינה מהווה <a href=\"https://en.wikipedia.org/wiki/Unique_factorization_domain\" target=\"_blank\">תחום פריקות יחידה</a>. זוהי תוצאה ישירה של שימוש בבסיס `k` כספרה במקום `0`. זה לא שובר את המערכת, אלא מדגיש את המבנה האלגברי הייחודי שלה.",
    "advFormalLangTitle": "קשר לתורת השפות הפורמליות",
    "advFormalLangDesc": "למערכת הספירה הביאקטיבית בבסיס 6 יש קשר יפהפה למדעי המחשב התיאורטיים. אם נגדיר אלפבית של סמלים, Σ (סיגמה), כקבוצת הספרות שלנו <code>{1, 2, 3, 4, 5, 6}</code>, אז קבוצת כל המחרוזות הסופיות האפשריות שניתן ליצור באמצעות סמלים אלה נקראת כוכב קלין, המסומן ב-Σ*. קבוצה זו כוללת את <code>{ε, 1, 2, ..., 6, 11, 12, ...}</code>, כאשר ε היא המחרוזת הריקה. המערכת הביאקטיבית היא מנייה מושלמת ומסודרת של קבוצה זו, המספקת דרך חלקה להקצות מספר שלם ייחודי לכל רצף של בחירות מתוך קבוצת השש שלנו.",
    "advGeoTitle": "פרשנות גיאומטרית: העץ האינסופי",
    "advGeoDesc": "אנו יכולים לדמיין את המערכת כולה כעץ 6-ארי אינסופי ושלם, שבו לכל צומת יש בדיוק שישה ילדים. שורש העץ מייצג נקודת התחלה. צמתי הרמה הראשונה מסומנים מ-1 עד 6. כל אחד מהצמתים הללו הוא הורה של שישה צמתים נוספים. לדוגמה, צומת \"2\" הוא הורה של הצמתים \"21\", \"22\", \"23\", \"24\", \"25\" ו-\"26\". במודל זה, כל מספר במערכת הספירה הביאקטיבית בבסיס 6 הוא ה\"כתובת\" או הנתיב הייחודי מהשורש לצומת ספציפי.",
    "donationBtn": "תמכו בפרויקט זה",
    "githubLink": "קוד המקור של הפרויקט זמין ב-",
    "licenseLink": "שוחרר תחת"
}
