{
    "pageTitle": "מחשבון ומגלה מערכות ספירה ביאקטיבית בבסיס 6",
    "pageDescription": "כלי חינוכי אינטראקטיבי לחישוב ולחקירת מערכת הספירה הביאקטיבית בבסיס 6. כולל כלים אינטראקטיביים, טבלאות עזר ומצב תרגול.",
    "themeSwitcherLabel": "החלף ערכת נושא",
    "mainTitle": "מחשבון ומגלה מערכות ספירה ביאקטיבית בבסיס 6",
    "tabExplore": "חקירה והמרה",
    "tabTables": "טבלאות עזר",
    "tabLearn": "למידה",
    "tabPractice": "תרגול",
    "liveConverterTitle": "מגלה המרות בזמן אמת",
    "liveConverterDesc": "הזן מספר עשרוני כדי לראות את ייצוגו במערכות שונות בזמן אמת.",
    "decimalInputLabel": "הזן מספר עשרוני:",
    "decimalInputPlaceholder": "לדוגמה, 43",
    "calculatorTitle": "מחשבון מתמטי ביאקטיבי",
    "calculatorDesc": "הזן שני מספרים במערכת הספירה הביאקטיבית בבסיס 6 כדי לראות את התוצאות של כל הפעולות.",
    "num1Placeholder": "מספר ראשון",
    "num2Placeholder": "מספר שני",
    "calculateBtn": "חשב",
    "resultsTitle": "תוצאות",
    "practiceTitle": "מצב תרגול",
    "practiceDesc": "בחנו את כישוריכם נגד השעון! בחרו רמת קושי ופתרו את התרגילים.",
    "difficultyLabel": "רמת קושי:",
    "difficultyEasy": "קל (1-12)",
    "difficultyHard": "קשה (1-50)",
    "quizSubmitBtn": "הגש",
    "quizNextBtn": "שאלה הבאה",
    "timeLabel": "זמן:",
    "additionTableTitle": "טבלת חיבור (1 עד 24)",
    "multiplicationTableTitle": "טבלת כפל (1 עד 24)",
    "primerTitle": "מבוא למערכות ספירה",
    "primerDesc1": "רוב מערכות הספירה שבהן אנו משתמשים הן <strong>מערכות מיקום</strong>. משמעות הדבר היא שערכה של ספרה תלוי במיקומה. \"בסיס\" המערכת אומר לנו בכמה ספרות ייחודיות משתמשים.",
    "explanationTitle": "הבנת המערכת הביאקטיבית",
    "explanationDesc1": "מערכת זו היא <strong>מערכת ספירה ביאקטיבית בבסיס 6</strong>. היא מערכת מיקום, אך עם שני הבדלים עיקריים: אין לה אפס, והספרות שלה נעות בין 1 ל-6. אחרי <code>6</code>, המספר הבא הוא <code>11</code>.",
    "algoTitle": "הסבר על אלגוריתם ההמרה",
    "algoDesc1": "הטריק להמרה ממערכת עשרונית לביאקטיבית בבסיס 6 הוא להזיז זמנית את מערכת המספרים. אנו מגשרים על הפער בין שאריות המחשב (0-5) לספרות שלנו (1-6) על ידי חיסור 1 לפני כל חישוב.",
    "visualizerPlaceholder": "הזן מספר עשרוני להדמיה...",
    "visualizeBtn": "הדגם",
    "formalLangTitle": "המתמטיקה מאחורי הקסם: קשר לתורת השפות הפורמליות",
    "formalLangDesc1": "למערכת הביאקטיבית בבסיס 6 יש קשר עמוק ויפהפה לתורת השפות הפורמליות, אבן יסוד במדעי המחשב התיאורטיים.",
    "formalLangDesc2": "בתחום זה, אנו מגדירים אלפבית, סיגמא, כקבוצה של סמלים. עבור המערכת שלנו, האלפבית הוא סיגמא = {1, 2, 3, 4, 5, 6}.",
    "formalLangDesc3": "קבוצת כל המחרוזות האפשריות שניתן ליצור באמצעות אלפבית זה ידועה ככוכב קלין (או סגור קלין) של סיגמא, ומסומנת כ-Sigma*. קבוצה זו כוללת מחרוזות בכל אורך סופי: {מחרוזת ריקה, 1, 2, ..., 6, 11, 12, ..., 66, 111, ...}.",
    "formalLangDesc4": "המערכת הביאקטיבית בבסיס 6 היא למעשה מנייה מושלמת ומסודרת של כוכב קלין של האלפבית {1, 2, 3, 4, 5, 6}, אם אנו ממפים את המחרוזת הריקה לאפס. כל מספר שלם חיובי מתאים בדיוק למחרוזת אחת, וכל מחרוזת מתאימה בדיוק למספר שלם חיובי אחד. זה חזק להפליא מכיוון שהוא מספק דרך חלקה להקצות מספר ייחודי לכל רצף של אירועים או בחירות מתוך קבוצה של שש, פעולה בסיסית באלגוריתמים ובתורת החישוביות.",
    "geomTitle": "פרשנות גיאומטרית: עץ ה-6-ארי האינסופי",
    "geomDesc1": "אנו יכולים לדמיין את המערכת כולה כעץ 6-ארי שלם ואינסופי. עץ 6-ארי הוא מבנה שבו לכל צומת יש בדיוק שישה ילדים.",
    "geomDesc2": "ניתן לחשוב על שורש העץ כנקודת התחלה (המייצגת את המספר 0 או את המחרוזת הריקה).",
    "geomList": [ "הרמה הראשונה של הצמתים מסומנת 1, 2, 3, 4, 5 ו-6.", "לכל אחד מהצמתים הללו יש שישה ילדים. לדוגמה, צומת \"1\" הוא ההורה של הצמתים \"11\", \"12\", \"13\", \"14\", \"15\" ו-\"16\"." ],
    "geomDesc4": "במודל זה, כל מספר ביאקטיבי בבסיס 6 הוא ה\"כתובת\" או ה\"נתיב\" הייחודי מהשורש לצומת ספציפי. לדוגמה, המספר 425 פירושו:",
    "geomPathList": [ "התחל מהשורש.", "קח את הענף הרביעי.", "מאותו צומת, קח את הענף השני.", "מאותו צומת, קח את הענף החמישי." ],
    "hashingTitle": "הערה על התנגשויות וגיבוב",
    "hashingDesc": "התבוננות בטבלת הכפל מגלה ש-<code>2 × 3 = 6</code> וגם <code>1 × 6 = 6</code>. זוהי <strong>התנגשות</strong>, כאשר קלטים שונים מניבים את אותו פלט. למרות שזה מעניין מבחינה מתמטית, תכונה זו הפוכה ממה שרצוי בפונקציות גיבוב קריפטוגרפיות (כמו SHA-256), אשר חייבות להיות מתוכננות במיוחד כדי להפוך את מציאת ההתנגשויות לבלתי אפשרית מבחינה חישובית. לכן, מערכת זו היא כלי טוב להבנת מושג ההתנגשויות, אך אינה אלגוריתם גיבוב מאובטח בעצמה.",
    "readingTitle": "לקריאה נוספת",
    "readingList": [
        "<strong>מבנה ופירוש של תוכניות מחשב (SICP)</strong> מאת אבלסון, סוסמן וסוסמן: טקסט יסוד המלמד מושגים בסיסיים בתכנות וחישוב.",
        "<strong>גדל, אשר, באך: צמה זהובה נצחית</strong> מאת דאגלס הופשטטר: ספר זוכה פרס פוליצר החוקר מושגים של מתמטיקה, סימטריה ואינטליגנציה.",
        "<strong>מבוא לאלגוריתמים (CLRS)</strong> מאת קורמן, לייזרסון, ריבסט ושטיין: ספר הלימוד האוניברסיטאי החיוני לתכנון וניתוח אלגוריתמים.",
        "<strong>מתמטיקה קונקרטית: יסוד למדעי המחשב</strong> מאת גרהם, קנוט ופטשניק: שילוב מבריק ומאתגר של מתמטיקה רציפה ובדידה למדעי המחשב."
    ],
    "donationBtn": "תמכו בפרויקט זה",
    "githubLink": "קוד המקור של הפרויקט זמין ב-",
    "licenseLink": "שוחרר תחת"
}
