{
    "pageTitle": "Биективный калькулятор и обозреватель Base-6",
    "pageDescription": "Интерактивный образовательный инструмент для расчета и изучения биективной системы счисления base-6, в которой нет нуля. Включает в себя конвертер в реальном времени и справочные таблицы.",
    "mainTitle": "Биективный калькулятор и обозреватель Base-6",
    "tabCalculator": "Калькулятор и обозреватель",
    "tabTables": "Справочные таблицы",
    "tabExplanations": "Объяснения",
    "liveConverterTitle": "Конвертер в реальном времени",
    "liveConverterDesc": "Введите десятичное число, чтобы увидеть его представление в разных системах в реальном времени.",
    "decimalInputLabel": "Введите десятичное число:",
    "calculatorTitle": "Биективный математический калькулятор",
    "calculatorDesc": "Введите два биективных числа base-6, чтобы увидеть результаты всех стандартных математических операций.",
    "num1Placeholder": "Первое число",
    "num2Placeholder": "Второе число",
    "calculateBtn": "Рассчитать все операции",
    "resultsTitle": "Результаты",
    "additionTableTitle": "Таблица сложения (от 1 до 12)",
    "multiplicationTableTitle": "Таблица умножения (от 1 до 12)",
    "primerTitle": "Введение в системы счисления",
    "primerDesc1": "Большинство используемых нами систем счисления являются <strong>позиционными</strong>. Это означает, что значение цифры зависит от ее положения в числе. \"Основание\" системы говорит нам, сколько уникальных цифр используется.",
    "primerDesc2": "В этих стандартных системах цифра <strong>ноль</strong> имеет решающее значение. Это не просто число, а фундаментальный <strong>заполнитель</strong>. Он означает пустую позицию, как, например, разряд десятков в числе <code>101</code>.",
    "explanationTitle": "Понимание биективной системы",
    "explanationDesc1": "Эта система представляет собой <strong>биективную нумерацию base-6</strong>. Она позиционная, но с двумя ключевыми отличиями: в ней нет нуля, а ее цифры варьируются от 1 до 6. Поскольку ноль отсутствует, система \"переворачивается\" по-другому. После <code>6</code> следующим числом является <code>11</code>.",
    "algoTitle": "Объяснение алгоритма преобразования",
    "algoDesc": "Хитрость преобразования из десятичной системы в биективную base-6 заключается во временном сдвиге системы счисления. Компьютеры естественным образом работают с остатками от 0 до 5, но наши цифры — от 1 до 6. Мы преодолеваем этот разрыв, вычитая 1 перед каждым вычислением.",
    "applicationsTitle": "Практическое применение",
    "applicationsDesc": "Биективная нумерация — это больше, чем просто математическая диковинка; она решает реальные проблемы в информатике.",
    "advancedTitle": "Более глубокие математические связи",
    "advancedDesc": "Свойства биективной нумерации распространяются на более сложные области информатики и математики, такие как криптография и алгоритмическое перечисление.",
    "donationBtn": "Поддержать этот проект",
    "githubLink": "Исходный код проекта доступен на",
    "licenseLink": "Выпущено под"
}
