{
    "pageTitle": "Биективный калькулятор и исследователь системы счисления по основанию 6",
    "pageDescription": "Интерактивный образовательный инструмент для расчета и исследования биективной системы счисления по основанию 6, в которой нет нуля. Включает в себя конвертер в реальном времени и справочные таблицы.",
    "themeSwitcherLabel": "Переключить тему",
    "mainTitle": "Биективный калькулятор и исследователь системы счисления по основанию 6",
    "tabCalculator": "Калькулятор и исследователь",
    "tabTables": "Справочные таблицы",
    "tabExplanations": "Объяснения",
    "liveConverterTitle": "Конвертер в реальном времени",
    "liveConverterDesc": "Введите десятичное число, чтобы увидеть его представление в различных системах в реальном времени.",
    "decimalInputLabel": "Введите десятичное число:",
    "decimalInputPlaceholder": "например, 25",
    "calculatorTitle": "Биективный математический калькулятор",
    "calculatorDesc": "Введите два числа в биективной системе счисления по основанию 6, чтобы увидеть результаты всех стандартных математических операций.",
    "num1Placeholder": "Первое число",
    "num2Placeholder": "Второе число",
    "calculateBtn": "Рассчитать все операции",
    "resultsTitle": "Результаты",
    "additionTableTitle": "Таблица сложения (от 1 до 12)",
    "multiplicationTableTitle": "Таблица умножения (от 1 до 12)",
    "primerTitle": "Введение в системы счисления",
    "primerDesc1": "Большинство используемых нами систем счисления являются <strong>позиционными</strong>. Это означает, что значение цифры зависит от ее положения в числе. \"Основание\" системы говорит нам, сколько уникальных цифр используется.",
    "primerDesc2": "В этих стандартных системах цифра <strong>ноль</strong> имеет важное значение как <strong>заполнитель</strong>. Он означает пустую позицию, как, например, в разряде десятков в числе <code>101</code>. Изучаемая вами биективная система интересна тем, что она работает без этого.",
    "explanationTitle": "Понимание биективной системы",
    "explanationDesc1": "Эта система является <strong>биективной системой счисления по основанию 6</strong>. Она позиционная, но с двумя ключевыми отличиями: в ней нет нуля, а ее цифры варьируются от 1 до 6. Поскольку нуля для выполнения функции заполнителя нет, система \"перескакивает\" по-другому. После <code>6</code> следующим числом является <code>11</code>.",
    "algoTitle": "Объяснение алгоритма преобразования",
    "algoDesc1": "Хитрость преобразования из десятичной системы в биективную по основанию 6 заключается во временном сдвиге системы счисления. Компьютеры естественным образом работают с остатками от 0 до 5, но наши цифры — от 1 до 6. Мы преодолеваем этот разрыв, вычитая 1 перед каждым вычислением.",
    "algoExampleTitle": "Давайте преобразуем десятичное число <strong>43</strong>:",
    "algoSteps": [
        "<strong>Шаг 1:</strong> <code>(43 - 1) % 6 = 0</code>. 0-я цифра в <code>\\\"123456\\\"</code> — это \'1\'. Результат: <strong>1</strong>. Следующее число: <code>(43 - 1) / 6 = 7</code>.",
        "<strong>Шаг 2:</strong> <code>(7 - 1) % 6 = 0</code>. 0-я цифра — это \'1\'. Результат: <strong>1</strong>. Следующее число: <code>(7 - 1) / 6 = 1</code>.",
        "<strong>Шаг 3:</strong> <code>(1 - 1) % 6 = 0</code>. 0-я цифра — это \'1\'. Результат: <strong>1</strong>. Следующее число: <code>(1 - 1) / 6 = 0</code>."
    ],
    "algoResult": "Перевернув цифры, получаем <code>111</code>. Таким образом, 43 в десятичной системе — это 111 в биективной системе счисления по основанию 6.",
    "applicationsTitle": "Практическое применение",
    "appDesc1": "Биективная система счисления — это больше, чем просто математическая диковинка; она решает реальные проблемы в информатике.",
    "appList": [
        "<strong>Столбцы в электронных таблицах:</strong> Microsoft Excel и Google Sheets используют биективную систему счисления по основанию 26 (A-Z). После Z идет AA, затем AB. Это прекрасный, интуитивно понятный пример из реального мира, где нет \"нулевого\" столбца.",
        "<strong>Сокращатели URL-адресов:</strong> Сервисам вроде bit.ly необходимо создавать как можно более короткие уникальные строки для миллиардов ссылок. Биективная система счисления по основанию 62 (<code>a-z, A-Z, 0-9</code>) может представить огромный идентификатор базы данных, такой как <code>2,183,401,055,849</code>, в виде короткой, чистой строки <code>`short`</code>.",
        "<strong>Счет на пальцах:</strong> Десятью пальцами можно сосчитать до 10 в десятичной системе. Но в биективной системе можно пойти гораздо дальше! Если каждый палец может быть поднят (1) или опущен (2), у вас есть биективная система по основанию 2. Десятью пальцами можно представить 2¹⁰ = 1024 числа. Это показывает мощь плотного представления без нуля."
    ],
    "advancedTitle": "Более глубокие математические связи",
    "advFactorizationTitle": "Примечание о \"составных\" цифрах и факторизации",
    "advFactorizationDesc": "Проницательный наблюдатель таблицы умножения заметит, что <code>2 × 3 = 6</code>, но также <code>1 × 6 = 6</code>. В нашей стандартной системе число 6 имеет уникальное разложение на простые множители (2 и 3). Однако в биективной системе <strong>цифра <code>6</code> сама по себе действует как составное число</strong>. Цифры <code>1, 2, 3, 4, 5</code> являются \"простыми\" в этом мире однозначных чисел. Это показывает, что множество однозначных чисел не образует <a href=\"https://en.wikipedia.org/wiki/Unique_factorization_domain\" target=\"_blank\">область уникальной факторизации</a>, что является прямым следствием использования основания `k` в качестве цифры вместо `0`.",
    "advFormalLangTitle": "Связь с теорией формальных языков",
    "advFormalLangDesc": "Биективная система по основанию 6 имеет прекрасную связь с теоретической информатикой. Если мы определим алфавит, Σ, как наш набор цифр <code>{1, 2, 3, 4, 5, 6}</code>, то множество всех возможных конечных строк (звезда Клини, Σ*) можно идеально перечислить с помощью положительных целых чисел. Это обеспечивает плавный способ присвоения уникального номера любой последовательности выборов из набора из шести.",
    "advGeoTitle": "Геометрическая интерпретация: бесконечное дерево",
    "advGeoDesc": "Мы можем визуализировать систему как бесконечное, полное 6-арное дерево, где каждый узел имеет шесть дочерних элементов. Каждое число в биективной системе по основанию 6 является уникальным \"адресом\" или путем от корня к определенному узлу. Число <code>425</code> означает: начать с корня, взять 4-ю ветвь, затем 2-ю, затем 5-ю. Это имеет решающее значение для индексации иерархических данных, где каждая часть адреса является осмысленным выбором.",
    "donationBtn": "Поддержать проект",
    "githubLink": "Исходный код проекта доступен на",
    "licenseLink": "Выпущено под"
}
