{
    "pageTitle": "Биективный калькулятор и исследователь по основанию 6",
    "pageDescription": "Интерактивный образовательный инструмент для расчета и исследования биективной системы счисления по основанию 6. Включает интерактивные инструменты, справочные таблицы и режим практики.",
    "themeSwitcherLabel": "Переключить тему",
    "mainTitle": "Биективный калькулятор и исследователь по основанию 6",
    "tabExplore": "Исследовать и конвертировать",
    "tabTables": "Справочные таблицы",
    "tabLearn": "Изучать",
    "tabPractice": "Практика",
    "liveConverterTitle": "Конвертер в реальном времени",
    "liveConverterDesc": "Введите десятичное число, чтобы увидеть его представление в различных системах в реальном времени.",
    "decimalInputLabel": "Введите десятичное число:",
    "decimalInputPlaceholder": "например, 43",
    "calculatorTitle": "Биективный математический калькулятор",
    "calculatorDesc": "Введите два числа в биективной системе счисления по основанию 6, чтобы увидеть результаты всех операций.",
    "num1Placeholder": "Первое число",
    "num2Placeholder": "Второе число",
    "calculateBtn": "Рассчитать",
    "resultsTitle": "Результаты",
    "practiceTitle": "Режим практики",
    "practiceDesc": "Проверьте свои навыки на время! Выберите сложность и решайте задачи.",
    "difficultyLabel": "Сложность:",
    "difficultyEasy": "Легко (1-12)",
    "difficultyHard": "Сложно (1-50)",
    "quizSubmitBtn": "Ответить",
    "quizNextBtn": "Следующий вопрос",
    "timeLabel": "Время:",
    "additionTableTitle": "Таблица сложения (1-24)",
    "multiplicationTableTitle": "Таблица умножения (1-24)",
    "primerTitle": "Введение в системы счисления",
    "primerDesc1": "Большинство используемых нами систем счисления являются <strong>позиционными</strong>. Это означает, что значение цифры зависит от ее положения. \"Основание\" системы говорит нам, сколько уникальных цифр используется.",
    "explanationTitle": "Понимание биективной системы",
    "explanationDesc1": "Эта система является <strong>биективной системой счисления по основанию 6</strong>. Она позиционная, но с двумя ключевыми отличиями: в ней нет нуля, а ее цифры варьируются от 1 до 6. После <code>6</code> следующим числом является <code>11</code>.",
    "algoTitle": "Объяснение алгоритма преобразования",
    "algoDesc1": "Хитрость преобразования из десятичной системы в биективную по основанию 6 заключается во временном сдвиге системы счисления. Мы преодолеваем разрыв между остатками от деления (0-5) и нашими цифрами (1-6), вычитая 1 перед каждым вычислением.",
    "visualizerPlaceholder": "Введите десятичное число для визуализации...",
    "visualizeBtn": "Визуализировать",
    "hashingTitle": "Примечание о коллизиях и хешировании",
    "hashingDesc": "Наблюдая за таблицей умножения, можно заметить, что <code>2 × 3 = 6</code> и <code>1 × 6 = 6</code>. Это <strong>коллизия</strong>, когда разные входные данные производят одинаковый результат. Хотя это интересно с математической точки зрения, это свойство противоположно тому, что требуется от криптографических хеш-функций (таких как SHA-256), которые должны быть специально разработаны так, чтобы находить коллизии было вычислительно невозможно. Таким образом, эта система является хорошим инструментом для понимания концепции коллизий, но не является безопасным алгоритмом хеширования.",
    "readingTitle": "Для дальнейшего чтения",
    "readingList": [
        "<strong>Структура и интерпретация компьютерных программ (SICP)</strong>, Абельсон, Сассман и Сассман: Основополагающий текст, обучающий фундаментальным концепциям программирования и вычислений.",
        "<strong>Гедель, Эшер, Бах: эта бесконечная гирлянда</strong>, Дуглас Хофштадтер: Книга, удостоенная Пулитцеровской премии, исследующая концепции математики, симметрии и интеллекта.",
        "<strong>Введение в алгоритмы (CLRS)</strong>, Кормен, Лейзерсон, Ривест и Штайн: Основной университетский учебник по разработке и анализу компьютерных алгоритмов.",
        "<strong>Конкретная математика: Основание для информатики</strong>, Грэхем, Кнут и Паташник: Блестящее сочетание непрерывной и дискретной математики для информатики."
    ],
    "donationBtn": "Поддержать проект",
    "githubLink": "Исходный код проекта доступен на",
    "licenseLink": "Выпущено под"
}
