{
    "pageTitle": "Биективный калькулятор и исследователь системы счисления по основанию 6",
    "pageDescription": "Интерактивный образовательный инструмент для расчета и исследования биективной системы счисления по основанию 6, в которой нет нуля. Включает в себя конвертер в реальном времени и справочные таблицы.",
    "mainTitle": "Биективный калькулятор и исследователь системы счисления по основанию 6",
    "tabCalculator": "Калькулятор и исследователь",
    "tabTables": "Справочные таблицы",
    "tabExplanations": "Объяснения",
    "liveConverterTitle": "Конвертер в реальном времени",
    "liveConverterDesc": "Введите десятичное число, чтобы увидеть его представление в различных системах в реальном времени.",
    "decimalInputLabel": "Введите десятичное число:",
    "decimalInputPlaceholder": "например, 25",
    "calculatorTitle": "Биективный математический калькулятор",
    "calculatorDesc": "Введите два числа в биективной системе счисления по основанию 6, чтобы увидеть результаты всех стандартных математических операций.",
    "num1Placeholder": "Первое число",
    "num2Placeholder": "Второе число",
    "calculateBtn": "Рассчитать все операции",
    "resultsTitle": "Результаты",
    "additionTableTitle": "Таблица сложения (от 1 до 12)",
    "multiplicationTableTitle": "Таблица умножения (от 1 до 12)",
    "primerTitle": "Введение в системы счисления",
    "primerDesc1": "Большинство используемых нами систем счисления являются <strong>позиционными</strong>. Это означает, что значение цифры зависит от ее положения в числе. \"Основание\" системы говорит нам, сколько уникальных цифр используется. Значение каждой позиции является степенью основания, начиная с 0 справа.",
    "primerDesc2": "В этих стандартных системах цифра <strong>ноль</strong> имеет важное значение. Это не просто число, а фундаментальный <strong>заполнитель</strong>. Он означает пустую позицию, как, например, в разряде десятков в числе <code>101</code>. Изучаемая вами биективная система интересна тем, что она работает без этого заполнителя.",
    "explanationTitle": "Понимание биективной системы",
    "explanationDesc1": "Эта система является <strong>биективной системой счисления по основанию 6</strong>. Она позиционная, но с двумя ключевыми отличиями: в ней нет нуля, а ее цифры варьируются от 1 до 6. Поскольку нуля для выполнения функции заполнителя нет, система \"перескакивает\" по-другому. После <code>6</code> следующим числом является <code>11</code>.",
    "algoTitle": "Объяснение алгоритма преобразования",
    "algoDesc1": "Хитрость преобразования из десятичной системы в биективную по основанию 6 заключается во временном сдвиге системы счисления. Компьютеры естественным образом работают с остатками от 0 до 5, но наши цифры — от 1 до 6. Мы преодолеваем этот разрыв, вычитая 1 перед каждым вычислением.",
    "algoExampleTitle": "Давайте преобразуем десятичное число <strong>43</strong>:",
    "algoStep1": "<strong>Шаг 1:</strong> Начнем с 43. Вычитаем 1: <code>43 - 1 = 42</code>. Теперь найдем остаток от деления на 6. <code>42 % 6 = 0</code>. 0-я цифра в нашем наборе символов <code>\"123456\"</code> — это '1'. Наша первая цифра результата — <strong>1</strong>. Новое число для следующего шага — <code>(42 - 0) / 6 = 7</code>.",
    "algoStep2": "<strong>Шаг 2:</strong> Начнем с 7. Вычитаем 1: <code>7 - 1 = 6</code>. Теперь найдем остаток. <code>6 % 6 = 0</code>. 0-я цифра — снова '1'. Наша вторая цифра результата — <strong>1</strong>. Новое число — <code>(6 - 0) / 6 = 1</code>.",
    "algoStep3": "<strong>Шаг 3:</strong> Начнем с 1. Вычитаем 1: <code>1 - 1 = 0</code>. Теперь найдем остаток. <code>0 % 6 = 0</code>. 0-я цифра — снова '1'. Наша третья цифра результата — <strong>1</strong>. Новое число — <code>(0 - 0) / 6 = 0</code>.",
    "algoResult": "Перевернув цифры, получаем <code>111</code>. Таким образом, 43 в десятичной системе — это 111 в биективной системе счисления по основанию 6.",
    "applicationsTitle": "Практическое применение",
    "appDesc1": "Биективная система счисления — это больше, чем просто математическая диковинка; она решает реальные проблемы в информатике.",
    "appSpreadsheet": "<strong>Столбцы в электронных таблицах:</strong> Microsoft Excel и Google Sheets используют биективную систему счисления по основанию 26 (A-Z) для столбцов. После Z идет AA, затем AB, AC и так далее. Это прекрасный, интуитивно понятный пример из реального мира, где нет \"нулевого\" столбца.",
    "appUrl": "<strong>Сокращатели URL-адресов:</strong> Сервисам вроде bit.ly необходимо создавать как можно более короткие уникальные строки для миллиардов ссылок. Биективная система счисления по основанию 62 (<code>a-z, A-Z, 0-9</code>) может представить огромный идентификатор базы данных, такой как <code>2,183,401,055,849</code>, в виде короткой, чистой строки <code>`short`</code>.",
    "advancedTitle": "Более глубокие математические связи",
    "advFactorizationTitle": "Примечание о 'составных' цифрах и факторизации",
    "advFactorizationDesc": "Проницательный наблюдатель таблицы умножения заметит нечто любопытное: <code>2 × 3 = 6</code>, но также <code>1 × 6 = 6</code>. В нашей стандартной системе счисления число 6 имеет уникальное разложение на простые множители (2 и 3). Однако в биективной системе <strong>цифра <code>6</code> сама по себе действует как составное число</strong>. Цифры <code>1, 2, 3, 4, 5</code> являются \"простыми\" в этом мире однозначных чисел. Это свойство раскрывает глубокую особенность: множество однозначных чисел в биективной системе не образует <a href=\"https://en.wikipedia.org/wiki/Unique_factorization_domain\" target=\"_blank\">область уникальной факторизации</a>. Это прямое следствие использования основания `k` в качестве цифры вместо `0`. Это не нарушает систему, а, скорее, подчеркивает ее уникальную алгебраическую структуру.",
    "advFormalLangTitle": "Связь с теорией формальных языков",
    "advFormalLangDesc": "Биективная система счисления по основанию 6 имеет прекрасную связь с теоретической информатикой. Если мы определим алфавит символов, Σ (Сигма), как наш набор цифр <code>{1, 2, 3, 4, 5, 6}</code>, то множество всех возможных конечных строк, которые можно создать с помощью этих символов, называется звездой Клини, обозначаемой Σ*. Этот набор включает <code>{ε, 1, 2, ..., 6, 11, 12, ...}</code>, где ε — пустая строка. Биективная система — это идеальное, упорядоченное перечисление этого набора, обеспечивающее плавный способ присвоения уникального целого числа любой последовательности выборов из нашего набора из шести.",
    "advGeoTitle": "Геометрическая интерпретация: бесконечное дерево",
    "advGeoDesc": "Мы можем визуализировать всю систему как бесконечное, полное 6-арное дерево, где каждый узел имеет ровно шесть дочерних элементов. Корень дерева представляет собой начальную точку. Узлы первого уровня помечены от 1 до 6. Каждый из этих узлов является родительским для еще шести узлов. Например, узел \"2\" является родительским для узлов \"21\", \"22\", \"23\", \"24\", \"25\" и \"26\". В этой модели каждое число в биективной системе счисления по основанию 6 является уникальным \"адресом\" или путем от корня к определенному узлу.",
    "donationBtn": "Поддержать проект",
    "githubLink": "Исходный код проекта доступен на",
    "licenseLink": "Выпущено под"
}
